<!--
+----------------------------------------------------------------------
| 友得云客  - 开启房产营销新纪元
+----------------------------------------------------------------------
| Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
+----------------------------------------------------------------------
| Licensed 友得云客不是自由软件 未经允许不可移除相关版权
+----------------------------------------------------------------------
| Author: www.youdeyunke.com
+----------------------------------------------------------------------
-->
<template>
    <div class="app-container">
        <advanced-card title="法拍房源-功能介绍" desc="用于在小程序端查询法拍房源信息，数据由管理员设置，小程序端用户可订阅即将开始的法拍房；订阅后法拍房开拍前，小程序端会收到消息推送提醒。"></advanced-card>
    </div>
</template>

<script>
import advancedCard from "../advancedCard.vue";
export default {
    name: "auctionhouse",
    components: { advancedCard },
};
</script>

<style scoped lang="scss"></style>
