<!--
+----------------------------------------------------------------------
| 友得云客  - 开启房产营销新纪元
+----------------------------------------------------------------------
| Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
+----------------------------------------------------------------------
| Licensed 友得云客不是自由软件 未经允许不可移除相关版权
+----------------------------------------------------------------------
| Author: www.youdeyunke.com
+----------------------------------------------------------------------
-->
<template>
    <div class="app-container">
        <advanced-card title="CRM-功能介绍"
            desc="用于对客户与线索进行管理，小程序端用户使用小程序会生成客户与线索，管理端管理员将线索与客户指派给置业顾问，小程序端置业顾问对线索与客户进行跟进，线索可以转为客户。"></advanced-card>
    </div>
</template>

<script>
import advancedCard from "../advancedCard.vue";
export default {
    name: "crm",
    components: { advancedCard },
};
</script>

<style scoped lang="scss"></style>
