/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
// components/pagemaker/searchbar/search-icon.js
Component({
    /**
     * 组件的属性列表
     */
    properties: {
        url: { type: String, default: null }
    },

    /**
     * 组件的初始数据
     */
    data: {
        defaultIcon: "https://tcdn.udeve.net/assets/icons/search-icon.png",

    },

    /**
     * 组件的方法列表
     */
    methods: {

    }
})
