/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自有软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: UDEVE Team <tech@udeve.cn>
* +----------------------------------------------------------------------
*/
// components/comments/comment-item-reply-items.js
Component({
    /**
     * 组件的属性列表
     */
    properties: {
        items: { type: Array, default: [] }
    },

    /**
     * 组件的初始数据
     */
    data: {
        show: false,

    },

    observers: {
        "items": function (val) {
            if (val.length == 0) {
                this.setData({ show: false })
                return true
            }
            this.setData({ show: true })
        },
    },

    /**
     * 组件的方法列表
     */
    methods: {
    }

})
