-- 管理员
INSERT INTO admin_users
(email, encrypted_password, reset_password_token, reset_password_sent_at, remember_created_at, sign_in_count,
 current_sign_in_at,
 last_sign_in_at, current_sign_in_ip, created_at, updated_at, avatar, name, `desc`, is_forever, expired_at, mobile,
 is_delete, api_key)
VALUES ('admin@example.com', '$2a$11$bdFdFR2nqkLfloUkETtnvur265SfofkPsstX9rNejHtRt1eRPDVvu', NULL, NULL, NULL, 0, NULL,
        NULL,
        NULL, NOW(), NOW(), '', 'example',
        NULL, 1, NULL, '', 0, '');


-- 角色
INSERT INTO roles
    (id, name, enable, icon, color, `key`, created_at, updated_at)
VALUES (1, '超级管理员', 1, NULL, NULL, NULL, NOW(), NOW());


-- 管理员关联角色
INSERT INTO admin_user_roles
    (role_id, admin_user_id, created_at, updated_at)
VALUES (1, 1, NOW(), NOW());


-- 城市
-- 陕西
insert into cities(name, is_public, adcode, `default`, home_page_id)
values ('西安市', 1, null, 0, null),
       ('铜川市', 1, null, 0, null),
       ('宝鸡市', 1, null, 0, null),
       ('咸阳市', 1, null, 0, null),
       ('渭南市', 1, null, 0, null),
       ('延安市', 1, null, 0, null),
       ('汉中市', 1, null, 0, null),
       ('榆林市', 1, null, 0, null),
       ('安康市', 1, null, 0, null),
       ('商洛市', 1, null, 0, null);

-- 山西
insert into cities(name, is_public, adcode, `default`, home_page_id)
values ('太原市', 1, null, 0, null),
       ('大同市', 1, null, 0, null),
       ('阳泉市', 1, null, 0, null),
       ('长治市', 1, null, 0, null),
       ('晋城市', 1, null, 0, null),
       ('朔州市', 1, null, 0, null),
       ('晋中市', 1, null, 0, null),
       ('运城市', 1, null, 0, null),
       ('忻州市', 1, null, 0, null),
       ('临汾市', 1, null, 0, null),
       ('吕梁市', 1, null, 0, null);

-- 河北
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('石家庄市', 1, null, 0, null),
       ('唐山市', 1, null, 0, null),
       ('秦皇岛市', 1, null, 0, null),
       ('邯郸市', 1, null, 0, null),
       ('邢台市', 1, null, 0, null),
       ('保定市', 1, null, 0, null),
       ('张家口市', 1, null, 0, null),
       ('承德市', 1, null, 0, null),
       ('沧州市', 1, null, 0, null),
       ('廊坊市', 1, null, 0, null),
       ('衡水市', 1, null, 0, null);

-- 辽宁
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('沈阳市', 1, null, 0, null),
       ('大连市', 1, null, 0, null),
       ('鞍山市', 1, null, 0, null),
       ('抚顺市', 1, null, 0, null),
       ('本溪市', 1, null, 0, null),
       ('丹东市', 1, null, 0, null),
       ('锦州市', 1, null, 0, null),
       ('营口市', 1, null, 0, null),
       ('阜新市', 1, null, 0, null),
       ('辽阳市', 1, null, 0, null),
       ('盘锦市', 1, null, 0, null),
       ('铁岭市', 1, null, 0, null),
       ('朝阳市', 1, null, 0, null),
       ('葫芦岛市', 1, null, 0, null);

-- 吉林
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('长春市', 1, null, 0, null),
       ('吉林市', 1, null, 0, null),
       ('四平市', 1, null, 0, null),
       ('辽源市', 1, null, 0, null),
       ('通化市', 1, null, 0, null),
       ('白山市', 1, null, 0, null),
       ('松原市', 1, null, 0, null),
       ('白城市', 1, null, 0, null),
       ('延边朝鲜族自治州', 1, null, 0, null);

-- 黑龙江
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('哈尔滨市', 1, null, 0, null),
       ('齐齐哈尔市', 1, null, 0, null),
       ('牡丹江市', 1, null, 0, null),
       ('佳木斯市', 1, null, 0, null),
       ('绥化市', 1, null, 0, null),
       ('黑河市', 1, null, 0, null),
       ('大兴安岭地区', 1, null, 0, null),
       ('伊春市', 1, null, 0, null),
       ('鹤岗市', 1, null, 0, null),
       ('双鸭山市', 1, null, 0, null),
       ('七台河市', 1, null, 0, null),
       ('鸡西市', 1, null, 0, null),
       ('大庆市', 1, null, 0, null);

-- 江苏
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('南京市', 1, null, 0, null),
       ('无锡市', 1, null, 0, null),
       ('徐州市', 1, null, 0, null),
       ('常州市', 1, null, 0, null),
       ('苏州市', 1, null, 0, null),
       ('南通市', 1, null, 0, null),
       ('连云港市', 1, null, 0, null),
       ('淮安市', 1, null, 0, null),
       ('盐城市', 1, null, 0, null),
       ('扬州市', 1, null, 0, null),
       ('镇江市', 1, null, 0, null),
       ('泰州市', 1, null, 0, null),
       ('宿迁市', 1, null, 0, null);

-- 浙江
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('杭州市', 1, null, 0, null),
       ('宁波市', 1, null, 0, null),
       ('温州市', 1, null, 0, null),
       ('嘉兴市', 1, null, 0, null),
       ('湖州市', 1, null, 0, null),
       ('绍兴市', 1, null, 0, null),
       ('金华市', 1, null, 0, null),
       ('衢州市', 1, null, 0, null),
       ('舟山市', 1, null, 0, null),
       ('台州市', 1, null, 0, null),
       ('丽水市', 1, null, 0, null);

-- 安徽
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('合肥市', 1, null, 0, null),
       ('芜湖市', 1, null, 0, null),
       ('蚌埠市', 1, null, 0, null),
       ('淮南市', 1, null, 0, null),
       ('马鞍山市', 1, null, 0, null),
       ('淮北市', 1, null, 0, null),
       ('铜陵市', 1, null, 0, null),
       ('安庆市', 1, null, 0, null),
       ('黄山市', 1, null, 0, null),
       ('滁州市', 1, null, 0, null),
       ('阜阳市', 1, null, 0, null),
       ('宿州市', 1, null, 0, null),
       ('六安市', 1, null, 0, null),
       ('亳州市', 1, null, 0, null),
       ('池州市', 1, null, 0, null),
       ('宣城市', 1, null, 0, null);

-- 福建
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('福州市', 1, null, 0, null),
       ('厦门市', 1, null, 0, null),
       ('莆田市', 1, null, 0, null),
       ('三明市', 1, null, 0, null),
       ('泉州市', 1, null, 0, null),
       ('漳州市', 1, null, 0, null),
       ('南平市', 1, null, 0, null),
       ('龙岩市', 1, null, 0, null),
       ('宁德市', 1, null, 0, null);

-- 江西
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('南昌市', 1, null, 0, null),
       ('九江市', 1, null, 0, null),
       ('上饶市', 1, null, 0, null),
       ('抚州市', 1, null, 0, null),
       ('宜春市', 1, null, 0, null),
       ('吉安市', 1, null, 0, null),
       ('赣州市', 1, null, 0, null),
       ('景德镇市', 1, null, 0, null),
       ('萍乡市', 1, null, 0, null),
       ('新余市', 1, null, 0, null),
       ('鹰潭市', 1, null, 0, null);

-- 山东
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('济南市', 1, null, 0, null),
       ('青岛市', 1, null, 0, null),
       ('淄博市', 1, null, 0, null),
       ('枣庄市', 1, null, 0, null),
       ('东营市', 1, null, 0, null),
       ('烟台市', 1, null, 0, null),
       ('潍坊市', 1, null, 0, null),
       ('济宁市', 1, null, 0, null),
       ('泰安市', 1, null, 0, null),
       ('威海市', 1, null, 0, null),
       ('日照市', 1, null, 0, null),
       ('临沂市', 1, null, 0, null),
       ('德州市', 1, null, 0, null),
       ('聊城市', 1, null, 0, null),
       ('滨州市', 1, null, 0, null),
       ('菏泽市', 1, null, 0, null);

-- 河南
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('郑州市', 1, null, 0, null),
       ('开封市', 1, null, 0, null),
       ('洛阳市', 1, null, 0, null),
       ('平顶山市', 1, null, 0, null),
       ('安阳市', 1, null, 0, null),
       ('鹤壁市', 1, null, 0, null),
       ('新乡市', 1, null, 0, null),
       ('焦作市', 1, null, 0, null),
       ('濮阳市', 1, null, 0, null),
       ('许昌市', 1, null, 0, null),
       ('漯河市', 1, null, 0, null),
       ('三门峡市', 1, null, 0, null),
       ('南阳市', 1, null, 0, null),
       ('商丘市', 1, null, 0, null),
       ('信阳市', 1, null, 0, null),
       ('周口市', 1, null, 0, null),
       ('驻马店市', 1, null, 0, null),
       ('济源市', 1, null, 0, null);

-- 湖北省
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('武汉市', 1, null, 0, null),
       ('黄石市', 1, null, 0, null),
       ('十堰市', 1, null, 0, null),
       ('宜昌市', 1, null, 0, null),
       ('襄阳市', 1, null, 0, null),
       ('鄂州市', 1, null, 0, null),
       ('荆门市', 1, null, 0, null),
       ('孝感市', 1, null, 0, null),
       ('荆州市', 1, null, 0, null),
       ('黄冈市', 1, null, 0, null),
       ('咸宁市', 1, null, 0, null),
       ('随州市', 1, null, 0, null),
       ('恩施土家族苗族自治州', 1, null, 0, null);

-- 湖南省
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('长沙市', 1, null, 0, null),
       ('株洲市', 1, null, 0, null),
       ('湘潭市', 1, null, 0, null),
       ('衡阳市', 1, null, 0, null),
       ('邵阳市', 1, null, 0, null),
       ('岳阳市', 1, null, 0, null),
       ('常德市', 1, null, 0, null),
       ('张家界市', 1, null, 0, null),
       ('益阳市', 1, null, 0, null),
       ('郴州市', 1, null, 0, null),
       ('永州市', 1, null, 0, null),
       ('怀化市', 1, null, 0, null),
       ('娄底市', 1, null, 0, null),
       ('湘西土家族苗族自治州', 1, null, 0, null);

-- 广东
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('广州市', 1, null, 0, null),
       ('深圳市', 1, null, 0, null),
       ('珠海市', 1, null, 0, null),
       ('汕头市', 1, null, 0, null),
       ('佛山市', 1, null, 0, null),
       ('韶关市', 1, null, 0, null),
       ('湛江市', 1, null, 0, null),
       ('肇庆市', 1, null, 0, null),
       ('江门市', 1, null, 0, null),
       ('茂名市', 1, null, 0, null),
       ('惠州市', 1, null, 0, null),
       ('梅州市', 1, null, 0, null),
       ('汕尾市', 1, null, 0, null),
       ('河源市', 1, null, 0, null),
       ('阳江市', 1, null, 0, null),
       ('清远市', 1, null, 0, null),
       ('东莞市', 1, null, 0, null),
       ('中山市', 1, null, 0, null),
       ('潮州市', 1, null, 0, null),
       ('揭阳市', 1, null, 0, null),
       ('云浮市', 1, null, 0, null);

-- 海南
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('海口市', 1, null, 0, null),
       ('三亚市', 1, null, 0, null),
       ('三沙市', 1, null, 0, null),
       ('儋州市', 1, null, 0, null);

-- 四川
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('成都市', 1, null, 0, null),
       ('自贡市', 1, null, 0, null),
       ('攀枝花市', 1, null, 0, null),
       ('泸州市', 1, null, 0, null),
       ('德阳市', 1, null, 0, null),
       ('绵阳市', 1, null, 0, null),
       ('广元市', 1, null, 0, null),
       ('遂宁市', 1, null, 0, null),
       ('内江市', 1, null, 0, null),
       ('乐山市', 1, null, 0, null),
       ('南充市', 1, null, 0, null),
       ('眉山市', 1, null, 0, null),
       ('宜宾市', 1, null, 0, null),
       ('广安市', 1, null, 0, null),
       ('达州市', 1, null, 0, null),
       ('雅安市', 1, null, 0, null),
       ('巴中市', 1, null, 0, null),
       ('资阳市', 1, null, 0, null),
       ('阿坝藏族羌族自治州', 1, null, 0, null),
       ('甘孜藏族自治州', 1, null, 0, null),
       ('凉山彝族自治州', 1, null, 0, null);


-- 贵州
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('贵阳市', 1, null, 0, null),
       ('六盘水市', 1, null, 0, null),
       ('遵义市', 1, null, 0, null),
       ('安顺市', 1, null, 0, null),
       ('毕节市', 1, null, 0, null),
       ('铜仁市', 1, null, 0, null),
       ('黔西南布依族苗族自治州', 1, null, 0, null),
       ('黔东南苗族侗族自治州', 1, null, 0, null),
       ('黔南布依族苗族自治州', 1, null, 0, null);

-- 云南
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('昆明市', 1, null, 0, null),
       ('曲靖市', 1, null, 0, null),
       ('玉溪市', 1, null, 0, null),
       ('保山市', 1, null, 0, null),
       ('昭通市', 1, null, 0, null),
       ('丽江市', 1, null, 0, null),
       ('普洱市', 1, null, 0, null),
       ('临沧市', 1, null, 0, null),
       ('楚雄彝族自治州', 1, null, 0, null),
       ('红河哈尼族彝族自治州', 1, null, 0, null),
       ('文山壮族苗族自治州', 1, null, 0, null),
       ('西双版纳傣族自治州', 1, null, 0, null),
       ('大理白族自治州', 1, null, 0, null),
       ('德宏傣族景颇族自治州', 1, null, 0, null),
       ('怒江傈僳族自治州', 1, null, 0, null),
       ('迪庆藏族自治州', 1, null, 0, null);

-- 甘肃
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('兰州市', 1, null, 0, null),
       ('嘉峪关市', 1, null, 0, null),
       ('金昌市', 1, null, 0, null),
       ('白银市', 1, null, 0, null),
       ('天水市', 1, null, 0, null),
       ('武威市', 1, null, 0, null),
       ('张掖市', 1, null, 0, null),
       ('平凉市', 1, null, 0, null),
       ('酒泉市', 1, null, 0, null),
       ('庆阳市', 1, null, 0, null),
       ('定西市', 1, null, 0, null),
       ('陇南市', 1, null, 0, null),
       ('临夏回族自治州', 1, null, 0, null),
       ('甘南藏族自治州', 1, null, 0, null);

-- 青海
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('西宁市', 1, null, 0, null),
       ('海东市', 1, null, 0, null),
       ('海北藏族自治州', 1, null, 0, null),
       ('黄南藏族自治州', 1, null, 0, null),
       ('海南藏族自治州', 1, null, 0, null),
       ('果洛藏族自治州', 1, null, 0, null),
       ('玉树藏族自治州', 1, null, 0, null),
       ('海西蒙古族藏族自治州', 1, null, 0, null);

-- 台湾
INSERT INTO cities(name, is_public, adcode, `default`, home_page_id)
VALUES ('台北市', 1, null, 0, null),
       ('新北市', 1, null, 0, null),
       ('桃园市', 1, null, 0, null),
       ('台中市', 1, null, 0, null),
       ('台南市', 1, null, 0, null),
       ('高雄市', 1, null, 0, null);


-- 行政区||县
insert into districts(name, city_id, is_public, `number`)
values ('新城区', 1, 1, 0),
       ('碑林区', 1, 1, 0),
       ('莲湖区', 1, 1, 0),
       ('雁塔区', 1, 1, 0),
       ('灞桥区', 1, 1, 0),
       ('未央区', 1, 1, 0),
       ('阎良区', 1, 1, 0),
       ('临潼区', 1, 1, 0),
       ('长安区', 1, 1, 0),
       ('高陵区', 1, 1, 0),
       ('鄠邑区', 1, 1, 0),
       ('蓝田县', 1, 1, 0),
       ('周至县', 1, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('王益区', 2, 1, 0),
       ('印台区', 2, 1, 0),
       ('耀州区', 2, 1, 0),
       ('宜君县', 2, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('渭滨区', 3, 1, 0),
       ('金台区', 3, 1, 0),
       ('陈仓区', 3, 1, 0),
       ('凤翔区', 3, 1, 0),
       ('岐山县', 3, 1, 0),
       ('扶风县', 3, 1, 0),
       ('眉县', 3, 1, 0),
       ('陇县', 3, 1, 0),
       ('千阳县', 3, 1, 0),
       ('麟游县', 3, 1, 0),
       ('凤县', 3, 1, 0),
       ('太白县', 3, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('秦都区', 4, 1, 0),
       ('渭城区', 4, 1, 0),
       ('杨陵区', 4, 1, 0),
       ('三原县', 4, 1, 0),
       ('泾阳县', 4, 1, 0),
       ('乾县', 4, 1, 0),
       ('礼泉县', 4, 1, 0),
       ('永寿县', 4, 1, 0),
       ('彬州市', 4, 1, 0),
       ('长武县', 4, 1, 0),
       ('旬邑县', 4, 1, 0),
       ('淳化县', 4, 1, 0),
       ('武功县', 4, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('临渭区', 5, 1, 0),
       ('华州区', 5, 1, 0),
       ('潼关县', 5, 1, 0),
       ('大荔县', 5, 1, 0),
       ('合阳县', 5, 1, 0),
       ('澄城县', 5, 1, 0),
       ('白水县', 5, 1, 0),
       ('蒲城县', 5, 1, 0),
       ('富平县', 5, 1, 0),
       ('韩城市', 5, 1, 0),
       ('华阴市', 5, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('宝塔区', 6, 1, 0),
       ('安塞区', 6, 1, 0),
       ('延长县', 6, 1, 0),
       ('延川县', 6, 1, 0),
       ('子长市', 6, 1, 0),
       ('志丹县', 6, 1, 0),
       ('吴起县', 6, 1, 0),
       ('甘泉县', 6, 1, 0),
       ('富县', 6, 1, 0),
       ('洛川县', 6, 1, 0),
       ('宜川县', 6, 1, 0),
       ('黄龙县', 6, 1, 0),
       ('黄陵县', 6, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('汉台区', 7, 1, 0),
       ('南郑区', 7, 1, 0),
       ('城固县', 7, 1, 0),
       ('洋县', 7, 1, 0),
       ('西乡县', 7, 1, 0),
       ('勉县', 7, 1, 0),
       ('宁强县', 7, 1, 0),
       ('略阳县', 7, 1, 0),
       ('镇巴县', 7, 1, 0),
       ('留坝县', 7, 1, 0),
       ('佛坪县', 7, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('榆阳区', 8, 1, 0),
       ('横山区', 8, 1, 0),
       ('神木市', 8, 1, 0),
       ('府谷县', 8, 1, 0),
       ('靖边县', 8, 1, 0),
       ('定边县', 8, 1, 0),
       ('绥德县', 8, 1, 0),
       ('米脂县', 8, 1, 0),
       ('佳县', 8, 1, 0),
       ('吴堡县', 8, 1, 0),
       ('清涧县', 8, 1, 0),
       ('子洲县', 8, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('汉滨区', 9, 1, 0),
       ('汉阴县', 9, 1, 0),
       ('旬阳县', 9, 1, 0),
       ('石泉县', 9, 1, 0),
       ('宁陕县', 9, 1, 0),
       ('紫阳县', 9, 1, 0),
       ('岚皋县', 9, 1, 0),
       ('平利县', 9, 1, 0),
       ('镇坪县', 9, 1, 0),
       ('旬阳县', 9, 1, 0),
       ('白河县', 9, 1, 0),
       ('略阳县', 9, 1, 0);



insert into districts(name, city_id, is_public, `number`)
values ('商州区', 10, 1, 0),
       ('洛南县', 10, 1, 0),
       ('丹凤县', 10, 1, 0),
       ('商南县', 10, 1, 0),
       ('山阳县', 10, 1, 0),
       ('镇安县', 10, 1, 0),
       ('柞水县', 10, 1, 0),
       ('商洛市镇坪产业园区', 10, 1, 0),
       ('商洛市杨河保护开发区', 10, 1, 0),
       ('商洛市商南产业园区', 10, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('小店区', 11, 1, 0),
       ('迎泽区', 11, 1, 0),
       ('杏花岭区', 11, 1, 0),
       ('尖草坪区', 11, 1, 0),
       ('万柏林区', 11, 1, 0),
       ('晋源区', 11, 1, 0),
       ('清徐县', 11, 1, 0),
       ('阳曲县', 11, 1, 0),
       ('娄烦县', 11, 1, 0),
       ('古交市', 11, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('平城区', 12, 1, 0),
       ('云冈区', 12, 1, 0),
       ('新荣区', 12, 1, 0),
       ('云州区', 12, 1, 0),
       ('阳高县', 12, 1, 0),
       ('天镇县', 12, 1, 0),
       ('广灵县', 12, 1, 0),
       ('灵丘县', 12, 1, 0),
       ('浑源县', 12, 1, 0),
       ('左云县', 12, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('城区', 13, 1, 0),
       ('矿区', 13, 1, 0),
       ('郊区', 13, 1, 0),
       ('平定县', 13, 1, 0),
       ('盂县', 13, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('潞州区', 14, 1, 0),
       ('上党区', 14, 1, 0),
       ('屯留区', 14, 1, 0),
       ('潞城区', 14, 1, 0),
       ('襄垣县', 14, 1, 0),
       ('平顺县', 14, 1, 0),
       ('黎城县', 14, 1, 0),
       ('壶关县', 14, 1, 0),
       ('长子县', 14, 1, 0),
       ('武乡县', 14, 1, 0),
       ('沁县', 14, 1, 0),
       ('沁源县', 14, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('城区', 15, 1, 0),
       ('沁水县', 15, 1, 0),
       ('阳城县', 15, 1, 0),
       ('陵川县', 15, 1, 0),
       ('泽州县', 15, 1, 0),
       ('高平市', 15, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('朔城区', 16, 1, 0),
       ('平鲁区', 16, 1, 0),
       ('山阴县', 16, 1, 0),
       ('应县', 16, 1, 0),
       ('右玉县', 16, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('榆次区', 17, 1, 0),
       ('太谷区', 17, 1, 0),
       ('榆社县', 17, 1, 0),
       ('左权县', 17, 1, 0),
       ('和顺县', 17, 1, 0),
       ('昔阳县', 17, 1, 0),
       ('寿阳县', 17, 1, 0),
       ('祁县', 17, 1, 0),
       ('平遥县', 17, 1, 0),
       ('灵石县', 17, 1, 0),
       ('介休市', 17, 1, 0);



INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('盐湖区', 18, 1, 0),
       ('临猗县', 18, 1, 0),
       ('万荣县', 18, 1, 0),
       ('闻喜县', 18, 1, 0),
       ('稷山县', 18, 1, 0),
       ('新绛县', 18, 1, 0),
       ('绛县', 18, 1, 0),
       ('垣曲县', 18, 1, 0),
       ('夏县', 18, 1, 0),
       ('平陆县', 18, 1, 0),
       ('芮城县', 18, 1, 0),
       ('永济市', 18, 1, 0),
       ('河津市', 18, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('忻府区', 19, 1, 0),
       ('定襄县', 19, 1, 0),
       ('五台县', 19, 1, 0),
       ('代县', 19, 1, 0),
       ('繁峙县', 19, 1, 0),
       ('宁武县', 19, 1, 0),
       ('静乐县', 19, 1, 0),
       ('神池县', 19, 1, 0),
       ('五寨县', 19, 1, 0),
       ('岢岚县', 19, 1, 0),
       ('河曲县', 19, 1, 0),
       ('保德县', 19, 1, 0),
       ('偏关县', 19, 1, 0),
       ('原平市', 19, 1, 0);



insert into districts(name, city_id, is_public, `number`)
values ('尧都区', 20, 1, 0),
       ('曲沃县', 20, 1, 0),
       ('翼城县', 20, 1, 0),
       ('襄汾县', 20, 1, 0),
       ('洪洞县', 20, 1, 0),
       ('古县', 20, 1, 0),
       ('安泽县', 20, 1, 0),
       ('浮山县', 20, 1, 0),
       ('吉县', 20, 1, 0),
       ('乡宁县', 20, 1, 0),
       ('大宁县', 20, 1, 0),
       ('隰县', 20, 1, 0),
       ('永和县', 20, 1, 0),
       ('蒲县', 20, 1, 0),
       ('汾西县', 20, 1, 0),
       ('侯马市', 20, 1, 0),
       ('霍州市', 20, 1, 0);



INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('离石区', 21, 1, 0),
       ('文水县', 21, 1, 0),
       ('交城县', 21, 1, 0),
       ('兴县', 21, 1, 0),
       ('临县', 21, 1, 0),
       ('柳林县', 21, 1, 0),
       ('石楼县', 21, 1, 0),
       ('岚县', 21, 1, 0),
       ('方山县', 21, 1, 0),
       ('中阳县', 21, 1, 0),
       ('孝义市', 21, 1, 0),
       ('汾阳市', 21, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('长安区', 22, 1, 0),
       ('桥西区', 22, 1, 0),
       ('新华区', 22, 1, 0),
       ('井陉矿区', 22, 1, 0),
       ('裕华区', 22, 1, 0),
       ('藁城区', 22, 1, 0),
       ('鹿泉区', 22, 1, 0),
       ('栾城区', 22, 1, 0),
       ('晋州市', 22, 1, 0),
       ('新乐市', 22, 1, 0),
       ('井陉县', 22, 1, 0),
       ('正定县', 22, 1, 0),
       ('行唐县', 22, 1, 0),
       ('灵寿县', 22, 1, 0),
       ('高邑县', 22, 1, 0),
       ('深泽县', 22, 1, 0),
       ('赞皇县', 22, 1, 0),
       ('无极县', 22, 1, 0),
       ('平山县', 22, 1, 0),
       ('元氏县', 22, 1, 0),
       ('赵县', 22, 1, 0),
       ('路南区', 23, 1, 0),
       ('路北区', 23, 1, 0),
       ('古冶区', 23, 1, 0),
       ('开平区', 23, 1, 0),
       ('丰南区', 23, 1, 0),
       ('丰润区', 23, 1, 0),
       ('曹妃甸区', 23, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('海港区', 24, 1, 0),
       ('山海关区', 24, 1, 0),
       ('北戴河区', 24, 1, 0),
       ('抚宁区', 24, 1, 0),
       ('青龙满族自治县', 24, 1, 0),
       ('昌黎县', 24, 1, 0),
       ('卢龙县', 24, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('邯山区', 25, 1, 0),
       ('丛台区', 25, 1, 0),
       ('复兴区', 25, 1, 0),
       ('峰峰矿区', 25, 1, 0),
       ('邯郸县', 25, 1, 0),
       ('临漳县', 25, 1, 0),
       ('成安县', 25, 1, 0),
       ('大名县', 25, 1, 0),
       ('涉县', 25, 1, 0),
       ('磁县', 25, 1, 0),
       ('肥乡县', 25, 1, 0),
       ('永年区', 25, 1, 0),
       ('邱县', 25, 1, 0),
       ('鸡泽县', 25, 1, 0),
       ('广平县', 25, 1, 0),
       ('馆陶县', 25, 1, 0),
       ('魏县', 25, 1, 0),
       ('曲周县', 25, 1, 0),
       ('武安市', 25, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('桥东区', 26, 1, 0),
       ('桥西区', 26, 1, 0),
       ('邢台县', 26, 1, 0),
       ('临城县', 26, 1, 0),
       ('内丘县', 26, 1, 0),
       ('柏乡县', 26, 1, 0),
       ('隆尧县', 26, 1, 0),
       ('任县', 26, 1, 0),
       ('南和区', 26, 1, 0),
       ('宁晋县', 26, 1, 0),
       ('巨鹿县', 26, 1, 0),
       ('新河县', 26, 1, 0),
       ('广宗县', 26, 1, 0),
       ('平乡县', 26, 1, 0),
       ('威县', 26, 1, 0),
       ('清河县', 26, 1, 0),
       ('临西县', 26, 1, 0),
       ('南宫市', 26, 1, 0),
       ('沙河市', 26, 1, 0),
       ('竞秀区', 27, 1, 0),
       ('莲池区', 27, 1, 0),
       ('满城区', 27, 1, 0),
       ('清苑区', 27, 1, 0),
       ('涞水县', 27, 1, 0),
       ('阜平县', 27, 1, 0),
       ('徐水区', 27, 1, 0),
       ('定兴县', 27, 1, 0),
       ('唐县', 27, 1, 0),
       ('高阳县', 27, 1, 0),
       ('容城县', 27, 1, 0),
       ('涞源县', 27, 1, 0),
       ('望都县', 27, 1, 0),
       ('安新县', 27, 1, 0),
       ('易县', 27, 1, 0),
       ('曲阳县', 27, 1, 0),
       ('蠡县', 27, 1, 0),
       ('顺平县', 27, 1, 0),
       ('博野县', 27, 1, 0),
       ('雄县', 27, 1, 0),
       ('涿州市', 27, 1, 0),
       ('定州市', 27, 1, 0),
       ('安国市', 27, 1, 0),
       ('高碑店市', 27, 1, 0),
       ('张家口市', 28, 1, 0),
       ('桥东区', 28, 1, 0),
       ('桥西区', 28, 1, 0),
       ('宣化区', 28, 1, 0),
       ('下花园区', 28, 1, 0),
       ('万全区', 28, 1, 0),
       ('崇礼区', 28, 1, 0),
       ('张北县', 28, 1, 0),
       ('康保县', 28, 1, 0),
       ('沽源县', 28, 1, 0),
       ('尚义县', 28, 1, 0),
       ('蔚县', 28, 1, 0),
       ('阳原县', 28, 1, 0),
       ('怀安县', 28, 1, 0),
       ('怀来县', 28, 1, 0),
       ('涿鹿县', 28, 1, 0),
       ('赤城县', 28, 1, 0),
       ('承德市', 29, 1, 0),
       ('双桥区', 29, 1, 0),
       ('双滦区', 29, 1, 0),
       ('鹰手营子矿区', 29, 1, 0),
       ('承德县', 29, 1, 0),
       ('兴隆县', 29, 1, 0),
       ('平泉市', 29, 1, 0),
       ('滦平县', 29, 1, 0),
       ('隆化县', 29, 1, 0),
       ('丰宁满族自治县', 29, 1, 0),
       ('宽城满族自治县', 29, 1, 0),
       ('围场满族蒙古族自治县', 29, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('沧州市辖区', 30, 1, 0),
       ('运河区', 30, 1, 0),
       ('新华区', 30, 1, 0),
       ('沧县', 30, 1, 0),
       ('青县', 30, 1, 0),
       ('东光县', 30, 1, 0),
       ('海兴县', 30, 1, 0),
       ('盐山县', 30, 1, 0),
       ('肃宁县', 30, 1, 0),
       ('南皮县', 30, 1, 0),
       ('吴桥县', 30, 1, 0),
       ('献县', 30, 1, 0),
       ('孟村回族自治县', 30, 1, 0),
       ('泊头市', 30, 1, 0),
       ('任丘市', 30, 1, 0),
       ('黄骅市', 30, 1, 0),
       ('河间市', 30, 1, 0),
       ('廊坊市辖区', 31, 1, 0),
       ('安次区', 31, 1, 0),
       ('广阳区', 31, 1, 0),
       ('固安县', 31, 1, 0),
       ('永清县', 31, 1, 0),
       ('香河县', 31, 1, 0),
       ('大城县', 31, 1, 0),
       ('文安县', 31, 1, 0),
       ('大厂回族自治县', 31, 1, 0),
       ('霸州市', 31, 1, 0),
       ('三河市', 31, 1, 0),
       ('衡水市辖区', 32, 1, 0),
       ('桃城区', 32, 1, 0),
       ('枣强县', 32, 1, 0),
       ('武邑县', 32, 1, 0),
       ('武强县', 32, 1, 0),
       ('饶阳县', 32, 1, 0),
       ('安平县', 32, 1, 0),
       ('故城县', 32, 1, 0),
       ('景县', 32, 1, 0),
       ('阜城县', 32, 1, 0),
       ('冀州市', 32, 1, 0),
       ('深州市', 32, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('和平区', 33, 1, 0),
       ('沈河区', 33, 1, 0),
       ('大东区', 33, 1, 0),
       ('皇姑区', 33, 1, 0),
       ('铁西区', 33, 1, 0),
       ('苏家屯区', 33, 1, 0),
       ('浑南区', 33, 1, 0),
       ('沈北新区', 33, 1, 0),
       ('于洪区', 33, 1, 0),
       ('辽中区', 33, 1, 0),
       ('康平县', 33, 1, 0),
       ('法库县', 33, 1, 0),
       ('新民市', 33, 1, 0),
       ('中山区', 34, 1, 0),
       ('西岗区', 34, 1, 0),
       ('沙河口区', 34, 1, 0),
       ('甘井子区', 34, 1, 0),
       ('旅顺口区', 34, 1, 0),
       ('金州区', 34, 1, 0),
       ('普兰店区', 34, 1, 0),
       ('长海县', 34, 1, 0),
       ('瓦房店市', 34, 1, 0),
       ('庄河市', 34, 1, 0),
       ('铁东区', 35, 1, 0),
       ('铁西区', 35, 1, 0),
       ('立山区', 35, 1, 0),
       ('千山区', 35, 1, 0),
       ('台安县', 35, 1, 0),
       ('岫岩满族自治县', 35, 1, 0),
       ('海城市', 35, 1, 0);

insert into districts(name, city_id, is_public, `number`)
values ('抚顺县', 36, 1, 0),
       ('新抚区', 36, 1, 0),
       ('东洲区', 36, 1, 0),
       ('望花区', 36, 1, 0),
       ('顺城区', 36, 1, 0),
       ('新宾满族自治县', 36, 1, 0),
       ('清原满族自治县', 36, 1, 0),
       ('平山区', 37, 1, 0),
       ('溪湖区', 37, 1, 0),
       ('明山区', 37, 1, 0),
       ('南芬区', 37, 1, 0),
       ('桓仁满族自治县', 37, 1, 0),
       ('元宝区', 38, 1, 0),
       ('振兴区', 38, 1, 0),
       ('振安区', 38, 1, 0),
       ('宽甸满族自治县', 38, 1, 0),
       ('东港市', 38, 1, 0),
       ('凤城市', 38, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('凌河区', 39, 1, 0),
       ('古塔区', 39, 1, 0),
       ('太和区', 39, 1, 0),
       ('滨海新区', 39, 1, 0),
       ('松山新区', 39, 1, 0),
       ('凌海市', 39, 1, 0),
       ('北镇市', 39, 1, 0),
       ('黑山县', 39, 1, 0),
       ('义县', 39, 1, 0),
       ('站前区', 40, 1, 0),
       ('西市区', 40, 1, 0),
       ('鲅鱼圈区', 40, 1, 0),
       ('老边区', 40, 1, 0),
       ('盖州市', 40, 1, 0),
       ('大石桥市', 40, 1, 0),
       ('海州区', 41, 1, 0),
       ('新邱区', 41, 1, 0),
       ('太平区', 41, 1, 0),
       ('清河门区', 41, 1, 0),
       ('细河区', 41, 1, 0),
       ('阜新蒙古族自治县', 41, 1, 0),
       ('彰武县', 41, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('白塔区', 42, 1, 0),
       ('文圣区', 42, 1, 0),
       ('宏伟区', 42, 1, 0),
       ('弓长岭区', 42, 1, 0),
       ('太子河区', 42, 1, 0),
       ('灯塔市', 42, 1, 0),
       ('双台子区', 43, 1, 0),
       ('兴隆台区', 43, 1, 0),
       ('大洼区', 43, 1, 0),
       ('盘山县', 43, 1, 0),
       ('银州区', 44, 1, 0),
       ('清河区', 44, 1, 0),
       ('铁岭县', 44, 1, 0),
       ('西丰县', 44, 1, 0),
       ('昌图县', 44, 1, 0),
       ('调兵山市', 44, 1, 0),
       ('开原市', 44, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('双塔区', 45, 1, 0),
       ('龙城区', 45, 1, 0),
       ('北票市', 45, 1, 0),
       ('凌源市', 45, 1, 0),
       ('朝阳县', 45, 1, 0),
       ('建平县', 45, 1, 0),
       ('喀喇沁左翼蒙古族自治县', 45, 1, 0),
       ('连山区', 46, 1, 0),
       ('龙港区', 46, 1, 0),
       ('南票区', 46, 1, 0),
       ('绥中县', 46, 1, 0),
       ('建昌县', 46, 1, 0),
       ('兴城市', 46, 1, 0),
       ('南关区', 47, 1, 0),
       ('宽城区', 47, 1, 0),
       ('朝阳区', 47, 1, 0),
       ('二道区', 47, 1, 0),
       ('绿园区', 47, 1, 0),
       ('双阳区', 47, 1, 0),
       ('九台区', 47, 1, 0),
       ('农安县', 47, 1, 0),
       ('榆树市', 47, 1, 0),
       ('德惠市', 47, 1, 0),
       ('船营区', 48, 1, 0),
       ('昌邑区', 48, 1, 0),
       ('龙潭区', 48, 1, 0),
       ('丰满区', 48, 1, 0),
       ('永吉县', 48, 1, 0),
       ('蛟河市', 48, 1, 0),
       ('桦甸市', 48, 1, 0),
       ('舒兰市', 48, 1, 0),
       ('磐石市', 48, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('铁西区', 49, 1, 0),
       ('铁东区', 49, 1, 0),
       ('梨树县', 49, 1, 0),
       ('伊通满族自治县', 49, 1, 0),
       ('双辽市', 49, 1, 0),
       ('龙山区', 50, 1, 0),
       ('西安区', 50, 1, 0),
       ('东丰县', 50, 1, 0),
       ('东辽县', 50, 1, 0),
       ('东昌区', 51, 1, 0),
       ('二道江区', 51, 1, 0),
       ('通化县', 51, 1, 0),
       ('辉南县', 51, 1, 0),
       ('柳河县', 51, 1, 0),
       ('梅河口市', 51, 1, 0),
       ('集安市', 51, 1, 0),
       ('浑江区', 52, 1, 0),
       ('江源区', 52, 1, 0),
       ('抚松县', 52, 1, 0),
       ('靖宇县', 52, 1, 0),
       ('长白朝鲜族自治县', 52, 1, 0),
       ('临江市', 52, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('宁江区', 53, 1, 0),
       ('前郭尔罗斯蒙古族自治县', 53, 1, 0),
       ('长岭县', 53, 1, 0),
       ('乾安县', 53, 1, 0),
       ('扶余市', 53, 1, 0),
       ('洮北区', 54, 1, 0),
       ('镇赉县', 54, 1, 0),
       ('通榆县', 54, 1, 0),
       ('洮南市', 54, 1, 0),
       ('大安市', 54, 1, 0),
       ('延吉市', 55, 1, 0),
       ('图们市', 55, 1, 0),
       ('敦化市', 55, 1, 0),
       ('珲春市', 55, 1, 0),
       ('龙井市', 55, 1, 0),
       ('和龙市', 55, 1, 0),
       ('汪清县', 55, 1, 0),
       ('安图县', 55, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('道里区', 56, 1, 0),
       ('南岗区', 56, 1, 0),
       ('道外区', 56, 1, 0),
       ('平房区', 56, 1, 0),
       ('松北区', 56, 1, 0),
       ('香坊区', 56, 1, 0),
       ('呼兰区', 56, 1, 0),
       ('阿城区', 56, 1, 0),
       ('双城区', 56, 1, 0),
       ('尚志市', 56, 1, 0),
       ('五常市', 56, 1, 0),
       ('依兰县', 56, 1, 0),
       ('方正县', 56, 1, 0),
       ('宾县', 56, 1, 0),
       ('巴彦县', 56, 1, 0),
       ('木兰县', 56, 1, 0),
       ('通河县', 56, 1, 0),
       ('延寿县', 56, 1, 0),
       ('讷河市', 57, 1, 0),
       ('龙江县', 57, 1, 0),
       ('依安县', 57, 1, 0),
       ('泰来县', 57, 1, 0),
       ('甘南县', 57, 1, 0),
       ('富裕县', 57, 1, 0),
       ('克山县', 57, 1, 0),
       ('克东县', 57, 1, 0),
       ('拜泉县', 57, 1, 0),
       ('鸡西市', 58, 1, 0),
       ('鸡冠区', 58, 1, 0),
       ('恒山区', 58, 1, 0),
       ('滴道区', 58, 1, 0),
       ('梨树区', 58, 1, 0),
       ('城子河区', 58, 1, 0),
       ('麻山区', 58, 1, 0),
       ('虎林市', 58, 1, 0),
       ('密山市', 58, 1, 0),
       ('鸡东县', 58, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('向阳区', 59, 1, 0),
       ('前进区', 59, 1, 0),
       ('东风区', 59, 1, 0),
       ('郊区', 59, 1, 0),
       ('同江市', 59, 1, 0),
       ('富锦市', 59, 1, 0),
       ('抚远市', 59, 1, 0),
       ('桦南县', 59, 1, 0),
       ('桦川县', 59, 1, 0),
       ('汤原县', 59, 1, 0),
       ('勃利县', 59, 1, 0),
       ('新兴区', 60, 1, 0),
       ('北林区', 60, 1, 0),
       ('望奎县', 60, 1, 0),
       ('兰西县', 60, 1, 0),
       ('青冈县', 60, 1, 0),
       ('庆安县', 60, 1, 0),
       ('明水县', 60, 1, 0),
       ('绥棱县', 60, 1, 0),
       ('安达市', 60, 1, 0),
       ('肇东市', 60, 1, 0),
       ('海伦市', 60, 1, 0),
       ('爱辉区', 61, 1, 0),
       ('嫩江市', 61, 1, 0),
       ('逊克县', 61, 1, 0),
       ('孙吴县', 61, 1, 0),
       ('北安市', 61, 1, 0),
       ('五大连池市', 61, 1, 0),
       ('加格达奇区', 62, 1, 0),
       ('松岭区', 62, 1, 0),
       ('新林区', 62, 1, 0),
       ('呼中区', 62, 1, 0),
       ('漠河市', 62, 1, 0),
       ('塔河县', 62, 1, 0),
       ('呼玛县', 62, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('伊美区', 63, 1, 0),
       ('友好区', 63, 1, 0),
       ('南岔县', 63, 1, 0),
       ('汤旺县', 63, 1, 0),
       ('丰林县', 63, 1, 0),
       ('大箐山县', 63, 1, 0),
       ('嘉荫县', 63, 1, 0),
       ('铁力市', 63, 1, 0),
       ('向阳区', 64, 1, 0),
       ('工农区', 64, 1, 0),
       ('南山区', 64, 1, 0),
       ('兴安区', 64, 1, 0),
       ('东山区', 64, 1, 0),
       ('兴山区', 64, 1, 0),
       ('萝北县', 64, 1, 0),
       ('绥滨县', 64, 1, 0),
       ('尖山区', 65, 1, 0),
       ('岭东区', 65, 1, 0),
       ('四方台区', 65, 1, 0),
       ('宝山区', 65, 1, 0),
       ('集贤县', 65, 1, 0),
       ('友谊县', 65, 1, 0),
       ('宝清县', 65, 1, 0),
       ('饶河县', 65, 1, 0),
       ('新兴区', 66, 1, 0),
       ('桃山区', 66, 1, 0),
       ('茄子河区', 66, 1, 0),
       ('勃利县', 66, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('鸡冠区', 67, 1, 0),
       ('恒山区', 67, 1, 0),
       ('滴道区', 67, 1, 0),
       ('梨树区', 67, 1, 0),
       ('城子河区', 67, 1, 0),
       ('麻山区', 67, 1, 0),
       ('鸡东县', 67, 1, 0),
       ('虎林市', 67, 1, 0),
       ('密山市', 67, 1, 0),
       ('萨尔图区', 68, 1, 0),
       ('龙凤区', 68, 1, 0),
       ('让胡路区', 68, 1, 0),
       ('红岗区', 68, 1, 0),
       ('大同区', 68, 1, 0),
       ('肇州县', 68, 1, 0),
       ('肇源县', 68, 1, 0),
       ('林甸县', 68, 1, 0),
       ('杜尔伯特蒙古族自治县', 68, 1, 0),
       ('玄武区', 69, 1, 0),
       ('秦淮区', 69, 1, 0),
       ('建邺区', 69, 1, 0),
       ('鼓楼区', 69, 1, 0),
       ('浦口区', 69, 1, 0),
       ('栖霞区', 69, 1, 0),
       ('雨花台区', 69, 1, 0),
       ('江宁区', 69, 1, 0),
       ('六合区', 69, 1, 0),
       ('溧水区', 69, 1, 0),
       ('高淳区', 69, 1, 0),
       ('梁溪区', 70, 1, 0),
       ('锡山区', 70, 1, 0),
       ('惠山区', 70, 1, 0),
       ('滨湖区', 70, 1, 0),
       ('新吴区', 70, 1, 0),
       ('江阴市', 70, 1, 0),
       ('宜兴市', 70, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('鼓楼区', 71, 1, 0),
       ('云龙区', 71, 1, 0),
       ('贾汪区', 71, 1, 0),
       ('泉山区', 71, 1, 0),
       ('铜山区', 71, 1, 0),
       ('丰县', 71, 1, 0),
       ('沛县', 71, 1, 0),
       ('睢宁县', 71, 1, 0),
       ('邳州市', 71, 1, 0),
       ('新沂市', 71, 1, 0),
       ('天宁区', 72, 1, 0),
       ('钟楼区', 72, 1, 0),
       ('新北区', 72, 1, 0),
       ('武进区', 72, 1, 0),
       ('金坛区', 72, 1, 0),
       ('溧阳市', 72, 1, 0),
       ('姑苏区', 73, 1, 0),
       ('虎丘区', 73, 1, 0),
       ('吴中区', 73, 1, 0),
       ('相城区', 73, 1, 0),
       ('吴江区', 73, 1, 0),
       ('常熟市', 73, 1, 0),
       ('张家港市', 73, 1, 0),
       ('昆山市', 73, 1, 0),
       ('太仓市', 73, 1, 0),
       ('崇川区', 74, 1, 0),
       ('通州区', 74, 1, 0),
       ('海门区', 74, 1, 0),
       ('启东市', 74, 1, 0),
       ('如皋市', 74, 1, 0),
       ('海安市', 74, 1, 0),
       ('如东县', 74, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('连云区', 75, 1, 0),
       ('海州区', 75, 1, 0),
       ('赣榆区', 75, 1, 0),
       ('东海县', 75, 1, 0),
       ('灌云县', 75, 1, 0),
       ('灌南县', 75, 1, 0),
       ('淮安区', 76, 1, 0),
       ('淮阴区', 76, 1, 0),
       ('清江浦区', 76, 1, 0),
       ('洪泽区', 76, 1, 0),
       ('涟水县', 76, 1, 0),
       ('盱眙县', 76, 1, 0),
       ('金湖县', 76, 1, 0),
       ('亭湖区', 77, 1, 0),
       ('盐都区', 77, 1, 0),
       ('大丰区', 77, 1, 0),
       ('响水县', 77, 1, 0),
       ('滨海县', 77, 1, 0),
       ('阜宁县', 77, 1, 0),
       ('射阳县', 77, 1, 0),
       ('建湖县', 77, 1, 0),
       ('东台市', 77, 1, 0),
       ('广陵区', 78, 1, 0),
       ('邗江区', 78, 1, 0),
       ('江都区', 78, 1, 0),
       ('宝应县', 78, 1, 0),
       ('仪征市', 78, 1, 0),
       ('高邮市', 78, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('京口区', 79, 1, 0),
       ('润州区', 79, 1, 0),
       ('丹徒区', 79, 1, 0),
       ('丹阳市', 79, 1, 0),
       ('扬中市', 79, 1, 0),
       ('句容市', 79, 1, 0),
       ('海陵区', 80, 1, 0),
       ('高港区', 80, 1, 0),
       ('姜堰区', 80, 1, 0),
       ('兴化市', 80, 1, 0),
       ('靖江市', 80, 1, 0),
       ('泰兴市', 80, 1, 0),
       ('宿城区', 81, 1, 0),
       ('宿豫区', 81, 1, 0),
       ('沭阳县', 81, 1, 0),
       ('泗阳县', 81, 1, 0),
       ('泗洪县', 81, 1, 0),
       ('上城区', 82, 1, 0),
       ('拱墅区', 82, 1, 0),
       ('西湖区', 82, 1, 0),
       ('滨江区', 82, 1, 0),
       ('萧山区', 82, 1, 0),
       ('余杭区', 82, 1, 0),
       ('富阳区', 82, 1, 0),
       ('临安区', 82, 1, 0),
       ('临平区', 82, 1, 0),
       ('钱塘区', 82, 1, 0),
       ('淳安县', 82, 1, 0),
       ('建德市', 82, 1, 0),
       ('桐庐县', 82, 1, 0),
       ('象山县', 82, 1, 0);



INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('海曙区', 83, 1, 0),
       ('江北区', 83, 1, 0),
       ('北仑区', 83, 1, 0),
       ('镇海区', 83, 1, 0),
       ('鄞州区', 83, 1, 0),
       ('奉化区', 83, 1, 0),
       ('象山县', 83, 1, 0),
       ('宁海县', 83, 1, 0),
       ('瑞安市', 84, 1, 0),
       ('鹿城区', 84, 1, 0),
       ('龙湾区', 84, 1, 0),
       ('瓯海区', 84, 1, 0),
       ('洞头区', 84, 1, 0),
       ('永嘉县', 84, 1, 0),
       ('平阳县', 84, 1, 0),
       ('苍南县', 84, 1, 0),
       ('文成县', 84, 1, 0),
       ('泰顺县', 84, 1, 0),
       ('乐清市', 84, 1, 0),
       ('南湖区', 85, 1, 0),
       ('秀洲区', 85, 1, 0),
       ('嘉善县', 85, 1, 0),
       ('海盐县', 85, 1, 0),
       ('海宁市', 85, 1, 0),
       ('平湖市', 85, 1, 0),
       ('桐乡市', 85, 1, 0),
       ('吴兴区', 86, 1, 0),
       ('南浔区', 86, 1, 0),
       ('德清县', 86, 1, 0),
       ('长兴县', 86, 1, 0),
       ('安吉县', 86, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('越城区', 87, 1, 0),
       ('柯桥区', 87, 1, 0),
       ('上虞区', 87, 1, 0),
       ('诸暨市', 87, 1, 0),
       ('嵊州市', 87, 1, 0),
       ('新昌县', 87, 1, 0),
       ('婺城区', 88, 1, 0),
       ('金东区', 88, 1, 0),
       ('兰溪市', 88, 1, 0),
       ('东阳市', 88, 1, 0),
       ('永康市', 88, 1, 0),
       ('义乌市', 88, 1, 0),
       ('浦江县', 88, 1, 0),
       ('武义县', 88, 1, 0),
       ('磐安县', 88, 1, 0),
       ('柯城区', 89, 1, 0),
       ('衢江区', 89, 1, 0),
       ('江山市', 89, 1, 0),
       ('常山县', 89, 1, 0),
       ('开化县', 89, 1, 0),
       ('龙游县', 89, 1, 0),
       ('定海区', 90, 1, 0),
       ('普陀区', 90, 1, 0),
       ('岱山县', 90, 1, 0),
       ('嵊泗县', 90, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('椒江区', 91, 1, 0),
       ('黄岩区', 91, 1, 0),
       ('路桥区', 91, 1, 0),
       ('临海市', 91, 1, 0),
       ('温岭市', 91, 1, 0),
       ('玉环市', 91, 1, 0),
       ('三门县', 91, 1, 0),
       ('天台县', 91, 1, 0),
       ('仙居县', 91, 1, 0),
       ('莲都区', 92, 1, 0),
       ('青田县', 92, 1, 0),
       ('缙云县', 92, 1, 0),
       ('遂昌县', 92, 1, 0),
       ('松阳县', 92, 1, 0),
       ('云和县', 92, 1, 0),
       ('庆元县', 92, 1, 0),
       ('景宁畲族自治县', 92, 1, 0),
       ('瑶海区', 93, 1, 0),
       ('庐阳区', 93, 1, 0),
       ('蜀山区', 93, 1, 0),
       ('包河区', 93, 1, 0),
       ('长丰县', 93, 1, 0),
       ('肥东县', 93, 1, 0),
       ('肥西县', 93, 1, 0),
       ('庐江县', 93, 1, 0),
       ('巢湖市', 93, 1, 0),
       ('镜湖区', 94, 1, 0),
       ('弋江区', 94, 1, 0),
       ('鸠江区', 94, 1, 0),
       ('三山区', 94, 1, 0),
       ('芜湖县', 94, 1, 0),
       ('繁昌县', 94, 1, 0),
       ('南陵县', 94, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('龙子湖区', 95, 1, 0),
       ('蚌山区', 95, 1, 0),
       ('禹会区', 95, 1, 0),
       ('淮上区', 95, 1, 0),
       ('怀远县', 95, 1, 0),
       ('五河县', 95, 1, 0),
       ('固镇县', 95, 1, 0),
       ('田家庵区', 96, 1, 0),
       ('大通区', 96, 1, 0),
       ('谢家集区', 96, 1, 0),
       ('八公山区', 96, 1, 0),
       ('潘集区', 96, 1, 0),
       ('凤台县', 96, 1, 0),
       ('花山区', 97, 1, 0),
       ('雨山区', 97, 1, 0),
       ('博望区', 97, 1, 0),
       ('当涂县', 97, 1, 0),
       ('含山县', 97, 1, 0),
       ('和县', 97, 1, 0),
       ('杜集区', 98, 1, 0),
       ('相山区', 98, 1, 0),
       ('烈山区', 98, 1, 0),
       ('濉溪县', 98, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('铜官区', 99, 1, 0),
       ('郊区', 99, 1, 0),
       ('义安区', 99, 1, 0),
       ('枞阳县', 99, 1, 0),
       ('迎江区', 100, 1, 0),
       ('大观区', 100, 1, 0),
       ('宜秀区', 100, 1, 0),
       ('怀宁县', 100, 1, 0),
       ('太湖县', 100, 1, 0),
       ('宿松县', 100, 1, 0),
       ('望江县', 100, 1, 0),
       ('岳西县', 100, 1, 0),
       ('桐城市', 100, 1, 0),
       ('屯溪区', 101, 1, 0),
       ('黄山区', 101, 1, 0),
       ('徽州区', 101, 1, 0),
       ('歙县', 101, 1, 0),
       ('休宁县', 101, 1, 0),
       ('黟县', 101, 1, 0),
       ('祁门县', 101, 1, 0),
       ('琅琊区', 102, 1, 0),
       ('南谯区', 102, 1, 0),
       ('来安县', 102, 1, 0),
       ('全椒县', 102, 1, 0),
       ('定远县', 102, 1, 0),
       ('凤阳县', 102, 1, 0),
       ('天长市', 102, 1, 0),
       ('明光市', 102, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('颍州区', 103, 1, 0),
       ('颍东区', 103, 1, 0),
       ('颍泉区', 103, 1, 0),
       ('临泉县', 103, 1, 0),
       ('太和县', 103, 1, 0),
       ('阜南县', 103, 1, 0),
       ('颍上县', 103, 1, 0),
       ('埇桥区', 104, 1, 0),
       ('砀山县', 104, 1, 0),
       ('萧县', 104, 1, 0),
       ('灵璧县', 104, 1, 0),
       ('泗县', 104, 1, 0),
       ('金安区', 105, 1, 0),
       ('裕安区', 105, 1, 0),
       ('叶集区', 105, 1, 0),
       ('霍邱县', 105, 1, 0),
       ('舒城县', 105, 1, 0),
       ('金寨县', 105, 1, 0),
       ('霍山县', 105, 1, 0),
       ('谯城区', 106, 1, 0),
       ('涡阳县', 106, 1, 0),
       ('蒙城县', 106, 1, 0),
       ('利辛县', 106, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('贵池区', 107, 1, 0),
       ('东至县', 107, 1, 0),
       ('石台县', 107, 1, 0),
       ('青阳县', 107, 1, 0),
       ('宣州区', 108, 1, 0),
       ('郎溪县', 108, 1, 0),
       ('泾县', 108, 1, 0),
       ('绩溪县', 108, 1, 0),
       ('旌德县', 108, 1, 0),
       ('宁国市', 108, 1, 0),
       ('鼓楼区', 109, 1, 0),
       ('台江区', 109, 1, 0),
       ('仓山区', 109, 1, 0),
       ('马尾区', 109, 1, 0),
       ('晋安区', 109, 1, 0),
       ('闽侯县', 109, 1, 0),
       ('连江县', 109, 1, 0),
       ('罗源县', 109, 1, 0),
       ('闽清县', 109, 1, 0),
       ('永泰县', 109, 1, 0),
       ('平潭县', 109, 1, 0),
       ('福清市', 109, 1, 0),
       ('长乐市', 109, 1, 0),
       ('思明区', 110, 1, 0),
       ('海沧区', 110, 1, 0),
       ('湖里区', 110, 1, 0),
       ('集美区', 110, 1, 0),
       ('同安区', 110, 1, 0),
       ('翔安区', 110, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('城厢区', 111, 1, 0),
       ('涵江区', 111, 1, 0),
       ('荔城区', 111, 1, 0),
       ('秀屿区', 111, 1, 0),
       ('仙游县', 111, 1, 0),
       ('梅列区', 112, 1, 0),
       ('三元区', 112, 1, 0),
       ('明溪县', 112, 1, 0),
       ('清流县', 112, 1, 0),
       ('宁化县', 112, 1, 0),
       ('大田县', 112, 1, 0),
       ('尤溪县', 112, 1, 0),
       ('沙县', 112, 1, 0),
       ('将乐县', 112, 1, 0),
       ('泰宁县', 112, 1, 0),
       ('建宁县', 112, 1, 0),
       ('永安市', 112, 1, 0),
       ('鲤城区', 113, 1, 0),
       ('丰泽区', 113, 1, 0),
       ('洛江区', 113, 1, 0),
       ('泉港区', 113, 1, 0),
       ('惠安县', 113, 1, 0),
       ('安溪县', 113, 1, 0),
       ('永春县', 113, 1, 0),
       ('德化县', 113, 1, 0),
       ('金门县', 113, 1, 0),
       ('石狮市', 113, 1, 0),
       ('晋江市', 113, 1, 0),
       ('南安市', 113, 1, 0),
       ('芗城区', 114, 1, 0),
       ('龙文区', 114, 1, 0),
       ('云霄县', 114, 1, 0),
       ('漳浦县', 114, 1, 0),
       ('诏安县', 114, 1, 0),
       ('长泰县', 114, 1, 0),
       ('东山县', 114, 1, 0),
       ('南靖县', 114, 1, 0),
       ('平和县', 114, 1, 0),
       ('华安县', 114, 1, 0),
       ('龙海市', 114, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('延平区', 115, 1, 0),
       ('建阳区', 115, 1, 0),
       ('顺昌县', 115, 1, 0),
       ('浦城县', 115, 1, 0),
       ('光泽县', 115, 1, 0),
       ('松溪县', 115, 1, 0),
       ('政和县', 115, 1, 0),
       ('邵武市', 115, 1, 0),
       ('武夷山市', 115, 1, 0),
       ('建瓯市', 115, 1, 0),
       ('新罗区', 116, 1, 0),
       ('永定区', 116, 1, 0),
       ('长汀县', 116, 1, 0),
       ('上杭县', 116, 1, 0),
       ('武平县', 116, 1, 0),
       ('连城县', 116, 1, 0),
       ('漳平市', 116, 1, 0),
       ('蕉城区', 117, 1, 0),
       ('霞浦县', 117, 1, 0),
       ('古田县', 117, 1, 0),
       ('屏南县', 117, 1, 0),
       ('寿宁县', 117, 1, 0),
       ('周宁县', 117, 1, 0),
       ('柘荣县', 117, 1, 0),
       ('福安市', 117, 1, 0),
       ('福鼎市', 117, 1, 0),
       ('东湖区', 118, 1, 0),
       ('西湖区', 118, 1, 0),
       ('青云谱区', 118, 1, 0),
       ('青山湖区', 118, 1, 0),
       ('新建区', 118, 1, 0),
       ('红谷滩区', 118, 1, 0),
       ('南昌县', 118, 1, 0),
       ('安义县', 118, 1, 0),
       ('进贤县', 118, 1, 0),
       ('东湖区', 118, 1, 0),
       ('西湖区', 118, 1, 0),
       ('青云谱区', 118, 1, 0),
       ('青山湖区', 118, 1, 0),
       ('新建区', 118, 1, 0),
       ('红谷滩区', 118, 1, 0),
       ('南昌县', 118, 1, 0),
       ('安义县', 118, 1, 0),
       ('进贤县', 118, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('濂溪区', 119, 1, 0),
       ('浔阳区', 119, 1, 0),
       ('柴桑区', 119, 1, 0),
       ('武宁县', 119, 1, 0),
       ('修水县', 119, 1, 0),
       ('永修县', 119, 1, 0),
       ('德安县', 119, 1, 0),
       ('都昌县', 119, 1, 0),
       ('湖口县', 119, 1, 0),
       ('彭泽县', 119, 1, 0),
       ('瑞昌市', 119, 1, 0),
       ('共青城市', 119, 1, 0),
       ('庐山市', 119, 1, 0),
       ('信州区', 120, 1, 0),
       ('广丰区', 120, 1, 0),
       ('广信区', 120, 1, 0),
       ('玉山县', 120, 1, 0),
       ('铅山县', 120, 1, 0),
       ('横峰县', 120, 1, 0),
       ('弋阳县', 120, 1, 0),
       ('余干县', 120, 1, 0),
       ('鄱阳县', 120, 1, 0),
       ('万年县', 120, 1, 0),
       ('婺源县', 120, 1, 0),
       ('德兴市', 120, 1, 0),
       ('临川区', 121, 1, 0),
       ('东乡区', 121, 1, 0),
       ('南城县', 121, 1, 0),
       ('黎川县', 121, 1, 0),
       ('南丰县', 121, 1, 0),
       ('崇仁县', 121, 1, 0),
       ('乐安县', 121, 1, 0),
       ('宜黄县', 121, 1, 0),
       ('金溪县', 121, 1, 0),
       ('资溪县', 121, 1, 0),
       ('广昌县', 121, 1, 0),
       ('东临新区', 121, 1, 0),
       ('临川区', 122, 1, 0),
       ('袁州区', 122, 1, 0),
       ('奉新县', 122, 1, 0),
       ('万载县', 122, 1, 0),
       ('上高县', 122, 1, 0),
       ('宜丰县', 122, 1, 0),
       ('靖安县', 122, 1, 0),
       ('铜鼓县', 122, 1, 0),
       ('丰城市', 122, 1, 0),
       ('樟树市', 122, 1, 0),
       ('高安市', 122, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('吉州区', 123, 1, 0),
       ('青原区', 123, 1, 0),
       ('井冈山市', 123, 1, 0),
       ('吉安县', 123, 1, 0),
       ('吉水县', 123, 1, 0),
       ('峡江县', 123, 1, 0),
       ('新干县', 123, 1, 0),
       ('永丰县', 123, 1, 0),
       ('泰和县', 123, 1, 0),
       ('遂川县', 123, 1, 0),
       ('万安县', 123, 1, 0),
       ('安福县', 123, 1, 0),
       ('永新县', 123, 1, 0),
       ('章贡区', 124, 1, 0),
       ('南康区', 124, 1, 0),
       ('赣县区', 124, 1, 0),
       ('信丰县', 124, 1, 0),
       ('大余县', 124, 1, 0),
       ('上犹县', 124, 1, 0),
       ('崇义县', 124, 1, 0),
       ('安远县', 124, 1, 0),
       ('龙南县', 124, 1, 0),
       ('定南县', 124, 1, 0),
       ('全南县', 124, 1, 0),
       ('宁都县', 124, 1, 0),
       ('于都县', 124, 1, 0),
       ('兴国县', 124, 1, 0),
       ('会昌县', 124, 1, 0),
       ('寻乌县', 124, 1, 0),
       ('石城县', 124, 1, 0),
       ('瑞金市', 124, 1, 0),
       ('昌江区', 125, 1, 0),
       ('珠山区', 125, 1, 0),
       ('浮梁县', 125, 1, 0),
       ('乐平市', 125, 1, 0),
       ('安源区', 126, 1, 0),
       ('湘东区', 126, 1, 0),
       ('莲花县', 126, 1, 0),
       ('上栗县', 126, 1, 0),
       ('芦溪县', 126, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('渝水区', 127, 1, 0),
       ('分宜县', 127, 1, 0),
       ('月湖区', 128, 1, 0),
       ('余江区', 128, 1, 0),
       ('贵溪市', 128, 1, 0),
       ('历下区', 129, 1, 0),
       ('市中区', 129, 1, 0),
       ('槐荫区', 129, 1, 0),
       ('天桥区', 129, 1, 0),
       ('历城区', 129, 1, 0),
       ('长清区', 129, 1, 0),
       ('章丘区', 129, 1, 0),
       ('济阳区', 129, 1, 0),
       ('莱芜区', 129, 1, 0),
       ('钢城区', 129, 1, 0),
       ('平阴县', 129, 1, 0),
       ('商河县', 129, 1, 0),
       ('市南区', 130, 1, 0),
       ('市北区', 130, 1, 0),
       ('黄岛区', 130, 1, 0),
       ('崂山区', 130, 1, 0),
       ('李沧区', 130, 1, 0),
       ('城阳区', 130, 1, 0),
       ('即墨区', 130, 1, 0),
       ('胶州市', 130, 1, 0),
       ('平度市', 130, 1, 0),
       ('莱西市', 130, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('淄川区', 131, 1, 0),
       ('张店区', 131, 1, 0),
       ('博山区', 131, 1, 0),
       ('临淄区', 131, 1, 0),
       ('周村区', 131, 1, 0),
       ('桓台县', 131, 1, 0),
       ('高青县', 131, 1, 0),
       ('沂源县', 131, 1, 0),
       ('薛城区', 132, 1, 0),
       ('市中区', 132, 1, 0),
       ('峄城区', 132, 1, 0),
       ('台儿庄区', 132, 1, 0),
       ('山亭区', 132, 1, 0),
       ('滕州市', 132, 1, 0),
       ('东营区', 133, 1, 0),
       ('河口区', 133, 1, 0),
       ('垦利区', 133, 1, 0),
       ('利津县', 133, 1, 0),
       ('广饶县', 133, 1, 0),
       ('芝罘区', 134, 1, 0),
       ('福山区', 134, 1, 0),
       ('牟平区', 134, 1, 0),
       ('莱山区', 134, 1, 0),
       ('蓬莱区', 134, 1, 0),
       ('龙口市', 134, 1, 0),
       ('莱阳市', 134, 1, 0),
       ('莱州市', 134, 1, 0),
       ('招远市', 134, 1, 0),
       ('栖霞市', 134, 1, 0),
       ('海阳市', 134, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('奎文区', 135, 1, 0),
       ('潍城区', 135, 1, 0),
       ('寒亭区', 135, 1, 0),
       ('坊子区', 135, 1, 0),
       ('青州市', 135, 1, 0),
       ('诸城市', 135, 1, 0),
       ('寿光市', 135, 1, 0),
       ('安丘市', 135, 1, 0),
       ('高密市', 135, 1, 0),
       ('昌邑市', 135, 1, 0),
       ('临朐县', 135, 1, 0),
       ('昌乐县', 135, 1, 0),
       ('任城区', 136, 1, 0),
       ('兖州区', 136, 1, 0),
       ('微山县', 136, 1, 0),
       ('鱼台县', 136, 1, 0),
       ('金乡县', 136, 1, 0),
       ('嘉祥县', 136, 1, 0),
       ('汶上县', 136, 1, 0),
       ('泗水县', 136, 1, 0),
       ('梁山县', 136, 1, 0),
       ('曲阜市', 136, 1, 0),
       ('邹城市', 136, 1, 0),
       ('泰山区', 137, 1, 0),
       ('岱岳区', 137, 1, 0),
       ('宁阳县', 137, 1, 0),
       ('东平县', 137, 1, 0),
       ('新泰市', 137, 1, 0),
       ('肥城市', 137, 1, 0),
       ('环翠区', 138, 1, 0),
       ('文登区', 138, 1, 0),
       ('荣成市', 138, 1, 0),
       ('乳山市', 138, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('东港区', 139, 1, 0),
       ('岚山区', 139, 1, 0),
       ('五莲县', 139, 1, 0),
       ('莒县', 139, 1, 0),
       ('兰山区', 140, 1, 0),
       ('罗庄区', 140, 1, 0),
       ('河东区', 140, 1, 0),
       ('沂南县', 140, 1, 0),
       ('郯城县', 140, 1, 0),
       ('沂水县', 140, 1, 0),
       ('兰陵县', 140, 1, 0),
       ('费县', 140, 1, 0),
       ('平邑县', 140, 1, 0),
       ('莒南县', 140, 1, 0),
       ('蒙阴县', 140, 1, 0),
       ('临沭县', 140, 1, 0),
       ('德城区', 141, 1, 0),
       ('陵城区', 141, 1, 0),
       ('宁津县', 141, 1, 0),
       ('庆云县', 141, 1, 0),
       ('临邑县', 141, 1, 0),
       ('齐河县', 141, 1, 0),
       ('平原县', 141, 1, 0),
       ('夏津县', 141, 1, 0),
       ('武城县', 141, 1, 0),
       ('乐陵市', 141, 1, 0),
       ('禹城市', 141, 1, 0),
       ('东昌府区', 142, 1, 0),
       ('茌平区', 142, 1, 0),
       ('阳谷县', 142, 1, 0),
       ('莘县', 142, 1, 0),
       ('东阿县', 142, 1, 0),
       ('冠县', 142, 1, 0),
       ('高唐县', 142, 1, 0),
       ('临清市', 142, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('滨城区', 143, 1, 0),
       ('沾化区', 143, 1, 0),
       ('邹平市', 143, 1, 0),
       ('惠民县', 143, 1, 0),
       ('阳信县', 143, 1, 0),
       ('无棣县', 143, 1, 0),
       ('博兴县', 143, 1, 0),
       ('曹县', 144, 1, 0),
       ('单县', 144, 1, 0),
       ('成武县', 144, 1, 0),
       ('巨野县', 144, 1, 0),
       ('郓城县', 144, 1, 0),
       ('鄄城县', 144, 1, 0),
       ('东明县', 144, 1, 0),
       ('中原区', 145, 1, 0),
       ('二七区', 145, 1, 0),
       ('管城回族区', 145, 1, 0),
       ('金水区', 145, 1, 0),
       ('上街区', 145, 1, 0),
       ('惠济区', 145, 1, 0),
       ('中牟县', 145, 1, 0),
       ('巩义市', 145, 1, 0),
       ('荥阳市', 145, 1, 0),
       ('新密市', 145, 1, 0),
       ('新郑市', 145, 1, 0),
       ('登封市', 145, 1, 0),
       ('龙亭区', 146, 1, 0),
       ('顺河回族区', 146, 1, 0),
       ('鼓楼区', 146, 1, 0),
       ('禹王台区', 146, 1, 0),
       ('祥符区', 146, 1, 0),
       ('杞县', 146, 1, 0),
       ('通许县', 146, 1, 0),
       ('尉氏县', 146, 1, 0),
       ('兰考县', 146, 1, 0);


-- 补充
INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('涧西区', 147, 1, 0),
       ('西工区', 147, 1, 0),
       ('老城区', 147, 1, 0),
       ('瀍河回族区', 147, 1, 0),
       ('洛龙区', 147, 1, 0),
       ('偃师区', 147, 1, 0),
       ('孟津区', 147, 1, 0),
       ('新安县', 147, 1, 0),
       ('栾川县', 147, 1, 0),
       ('嵩县', 147, 1, 0),
       ('汝阳县', 147, 1, 0),
       ('宜阳县', 147, 1, 0),
       ('洛宁县', 147, 1, 0),
       ('伊川县', 147, 1, 0),
       ('龙门石窟区', 147, 1, 0),
       ('新华区', 148, 1, 0),
       ('卫东区', 148, 1, 0),
       ('石龙区', 148, 1, 0),
       ('湛河区', 148, 1, 0),
       ('宝丰县', 148, 1, 0),
       ('叶县', 148, 1, 0),
       ('鲁山县', 148, 1, 0),
       ('郏县', 148, 1, 0),
       ('舞钢市', 148, 1, 0),
       ('汝州市', 148, 1, 0),
       ('文峰区', 149, 1, 0),
       ('北关区', 149, 1, 0),
       ('殷都区', 149, 1, 0),
       ('龙安区', 149, 1, 0),
       ('安阳县', 149, 1, 0),
       ('汤阴县', 149, 1, 0),
       ('滑县', 149, 1, 0),
       ('内黄县', 149, 1, 0),
       ('林州市', 149, 1, 0),
       ('淇滨区', 150, 1, 0),
       ('山城区', 150, 1, 0),
       ('鹤山区', 150, 1, 0),
       ('浚县', 150, 1, 0),
       ('淇县', 150, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('红旗区', 151, 1, 0),
       ('卫滨区', 151, 1, 0),
       ('凤泉区', 151, 1, 0),
       ('牧野区', 151, 1, 0),
       ('新乡县', 151, 1, 0),
       ('获嘉县', 151, 1, 0),
       ('原阳县', 151, 1, 0),
       ('延津县', 151, 1, 0),
       ('封丘县', 151, 1, 0),
       ('长垣市', 151, 1, 0),
       ('卫辉市', 151, 1, 0),
       ('辉县市', 151, 1, 0),
       ('解放区', 152, 1, 0),
       ('中站区', 152, 1, 0),
       ('马村区', 152, 1, 0),
       ('山阳区', 152, 1, 0),
       ('修武县', 152, 1, 0),
       ('博爱县', 152, 1, 0),
       ('武陟县', 152, 1, 0),
       ('温县', 152, 1, 0),
       ('沁阳市', 152, 1, 0),
       ('孟州市', 152, 1, 0),
       ('华龙区', 153, 1, 0),
       ('清丰县', 153, 1, 0),
       ('南乐县', 153, 1, 0),
       ('范县', 153, 1, 0),
       ('台前县', 153, 1, 0),
       ('濮阳县', 153, 1, 0),
       ('魏都区', 154, 1, 0),
       ('建安区', 154, 1, 0),
       ('鄢陵县', 154, 1, 0),
       ('襄城县', 154, 1, 0),
       ('禹州市', 154, 1, 0),
       ('长葛市', 154, 1, 0);



INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('源汇区', 155, 1, 0),
       ('郾城区', 155, 1, 0),
       ('召陵区', 155, 1, 0),
       ('舞阳县', 155, 1, 0),
       ('临颍县', 155, 1, 0),
       ('湖滨区', 156, 1, 0),
       ('陕州区', 156, 1, 0),
       ('卢氏县', 156, 1, 0),
       ('义马市', 156, 1, 0),
       ('灵宝市', 156, 1, 0),
       ('宛城区', 157, 1, 0),
       ('卧龙区', 157, 1, 0),
       ('南召县', 157, 1, 0),
       ('方城县', 157, 1, 0),
       ('西峡县', 157, 1, 0),
       ('镇平县', 157, 1, 0),
       ('内乡县', 157, 1, 0),
       ('淅川县', 157, 1, 0),
       ('社旗县', 157, 1, 0),
       ('唐河县', 157, 1, 0),
       ('新野县', 157, 1, 0),
       ('桐柏县', 157, 1, 0),
       ('邓州市', 157, 1, 0),
       ('梁园区', 158, 1, 0),
       ('睢阳区', 158, 1, 0),
       ('民权县', 158, 1, 0),
       ('睢县', 158, 1, 0),
       ('宁陵县', 158, 1, 0),
       ('柘城县', 158, 1, 0),
       ('虞城县', 158, 1, 0),
       ('夏邑县', 158, 1, 0),
       ('永城市', 158, 1, 0);

INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('浉河区', 159, 1, 0),
       ('平桥区', 159, 1, 0),
       ('罗山县', 159, 1, 0),
       ('光山县', 159, 1, 0),
       ('新县', 159, 1, 0),
       ('商城县', 159, 1, 0),
       ('固始县', 159, 1, 0),
       ('潢川县', 159, 1, 0),
       ('淮滨县', 159, 1, 0),
       ('息县', 159, 1, 0),
       ('川汇区', 160, 1, 0),
       ('淮阳区', 160, 1, 0),
       ('项城市', 160, 1, 0),
       ('扶沟县', 160, 1, 0),
       ('西华县', 160, 1, 0),
       ('商水县', 160, 1, 0),
       ('沈丘县', 160, 1, 0),
       ('郸城县', 160, 1, 0),
       ('太康县', 160, 1, 0),
       ('鹿邑县', 160, 1, 0),
       ('驿城区', 161, 1, 0),
       ('西平县', 161, 1, 0),
       ('上蔡县', 161, 1, 0),
       ('平舆县', 161, 1, 0),
       ('正阳县', 161, 1, 0),
       ('确山县', 161, 1, 0),
       ('泌阳县', 161, 1, 0),
       ('汝南县', 161, 1, 0),
       ('遂平县', 161, 1, 0),
       ('新蔡县', 161, 1, 0),
       ('北海区', 162, 1, 0),
       ('玉泉区', 162, 1, 0),
       ('沁园区', 162, 1, 0),
       ('济水区', 162, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('江岸区', 163, 1, 0),
       ('江汉区', 163, 1, 0),
       ('硚口区', 163, 1, 0),
       ('汉阳区', 163, 1, 0),
       ('武昌区', 163, 1, 0),
       ('青山区', 163, 1, 0),
       ('洪山区', 163, 1, 0),
       ('东西湖区', 163, 1, 0),
       ('汉南区', 163, 1, 0),
       ('蔡甸区', 163, 1, 0),
       ('江夏区', 163, 1, 0),
       ('黄陂区', 163, 1, 0),
       ('新洲区', 163, 1, 0),
       ('黄石港区', 164, 1, 0),
       ('西塞山区', 164, 1, 0),
       ('下陆区', 164, 1, 0),
       ('铁山区', 164, 1, 0),
       ('阳新县', 164, 1, 0),
       ('大冶市', 164, 1, 0),
       ('茅箭区', 165, 1, 0),
       ('张湾区', 165, 1, 0),
       ('郧阳区', 165, 1, 0),
       ('郧西县', 165, 1, 0),
       ('竹山县', 165, 1, 0),
       ('竹溪县', 165, 1, 0),
       ('房县', 165, 1, 0),
       ('丹江口市', 165, 1, 0),
       ('西陵区', 166, 1, 0),
       ('伍家岗区', 166, 1, 0),
       ('点军区', 166, 1, 0),
       ('猇亭区', 166, 1, 0),
       ('夷陵区', 166, 1, 0),
       ('远安县', 166, 1, 0),
       ('兴山县', 166, 1, 0),
       ('秭归县', 166, 1, 0),
       ('长阳土家族自治县', 166, 1, 0),
       ('五峰土家族自治县', 166, 1, 0),
       ('宜都市', 166, 1, 0),
       ('当阳市', 166, 1, 0),
       ('枝江市', 166, 1, 0);



INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('襄城区', 167, 1, 0),
       ('樊城区', 167, 1, 0),
       ('襄州区', 167, 1, 0),
       ('南漳县', 167, 1, 0),
       ('谷城县', 167, 1, 0),
       ('保康县', 167, 1, 0),
       ('老河口市', 167, 1, 0),
       ('枣阳市', 167, 1, 0),
       ('宜城市', 167, 1, 0),
       ('梁子湖区', 168, 1, 0),
       ('华容区', 168, 1, 0),
       ('鄂城区', 168, 1, 0),
       ('东宝区', 169, 1, 0),
       ('掇刀区', 169, 1, 0),
       ('京山县', 169, 1, 0),
       ('沙洋县', 169, 1, 0),
       ('钟祥市', 169, 1, 0),
       ('孝南区', 170, 1, 0),
       ('孝昌县', 170, 1, 0),
       ('大悟县', 170, 1, 0),
       ('云梦县', 170, 1, 0),
       ('应城市', 170, 1, 0),
       ('安陆市', 170, 1, 0),
       ('汉川市', 170, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('沙市区', 171, 1, 0),
       ('荆州区', 171, 1, 0),
       ('公安县', 171, 1, 0),
       ('监利县', 171, 1, 0),
       ('江陵县', 171, 1, 0),
       ('石首市', 171, 1, 0),
       ('洪湖市', 171, 1, 0),
       ('黄州区', 172, 1, 0),
       ('团风县', 172, 1, 0),
       ('红安县', 172, 1, 0),
       ('罗田县', 172, 1, 0),
       ('英山县', 172, 1, 0),
       ('浠水县', 172, 1, 0),
       ('蕲春县', 172, 1, 0),
       ('黄梅县', 172, 1, 0),
       ('麻城市', 172, 1, 0),
       ('武穴市', 172, 1, 0),
       ('咸安区', 173, 1, 0),
       ('嘉鱼县', 173, 1, 0),
       ('通城县', 173, 1, 0),
       ('崇阳县', 173, 1, 0),
       ('通山县', 173, 1, 0),
       ('赤壁市', 173, 1, 0),
       ('随州经济开发区', 174, 1, 0),
       ('曾都区', 174, 1, 0),
       ('随县', 174, 1, 0),
       ('广水市', 174, 1, 0);

INSERT INTO districts (name, city_id, is_public, number)
VALUES ('恩施市', 175, 1, 0),
       ('利川市', 175, 1, 0),
       ('建始县', 175, 1, 0),
       ('巴东县', 175, 1, 0),
       ('宣恩县', 175, 1, 0),
       ('咸丰县', 175, 1, 0),
       ('来凤县', 175, 1, 0),
       ('鹤峰县', 175, 1, 0),
       ('芙蓉区', 176, 1, 0),
       ('天心区', 176, 1, 0),
       ('岳麓区', 176, 1, 0),
       ('开福区', 176, 1, 0),
       ('雨花区', 176, 1, 0),
       ('长沙县', 176, 1, 0),
       ('望城区', 176, 1, 0),
       ('宁乡市', 176, 1, 0),
       ('浏阳市', 176, 1, 0),
       ('荷塘区', 177, 1, 0),
       ('芦淞区', 177, 1, 0),
       ('石峰区', 177, 1, 0),
       ('天元区', 177, 1, 0),
       ('株洲县', 177, 1, 0),
       ('攸县', 177, 1, 0),
       ('茶陵县', 177, 1, 0),
       ('炎陵县', 177, 1, 0),
       ('醴陵市', 177, 1, 0),
       ('雨湖区', 178, 1, 0),
       ('岳塘区', 178, 1, 0),
       ('湘潭县', 178, 1, 0),
       ('湘乡市', 178, 1, 0),
       ('韶山市', 178, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('珠晖区', 179, 1, 0),
       ('雁峰区', 179, 1, 0),
       ('石鼓区', 179, 1, 0),
       ('蒸湘区', 179, 1, 0),
       ('南岳区', 179, 1, 0),
       ('衡阳县', 179, 1, 0),
       ('衡南县', 179, 1, 0),
       ('衡山县', 179, 1, 0),
       ('衡东县', 179, 1, 0),
       ('祁东县', 179, 1, 0),
       ('耒阳市', 179, 1, 0),
       ('常宁市', 179, 1, 0),
       ('双清区', 180, 1, 0),
       ('大祥区', 180, 1, 0),
       ('北塔区', 180, 1, 0),
       ('邵东县', 180, 1, 0),
       ('新邵县', 180, 1, 0),
       ('邵阳县', 180, 1, 0),
       ('隆回县', 180, 1, 0),
       ('洞口县', 180, 1, 0),
       ('绥宁县', 180, 1, 0),
       ('新宁县', 180, 1, 0),
       ('城步苗族自治县', 180, 1, 0),
       ('武冈市', 180, 1, 0),
       ('岳阳楼区', 181, 1, 0),
       ('云溪区', 181, 1, 0),
       ('君山区', 181, 1, 0),
       ('岳阳县', 181, 1, 0),
       ('华容县', 181, 1, 0),
       ('湘阴县', 181, 1, 0),
       ('平江县', 181, 1, 0),
       ('汨罗市', 181, 1, 0),
       ('临湘市', 181, 1, 0),
       ('武陵区', 182, 1, 0),
       ('鼎城区', 182, 1, 0),
       ('安乡县', 182, 1, 0),
       ('汉寿县', 182, 1, 0),
       ('澧县', 182, 1, 0),
       ('临澧县', 182, 1, 0),
       ('桃源县', 182, 1, 0),
       ('石门县', 182, 1, 0),
       ('津市市', 182, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('永定区', 183, 1, 0),
       ('武陵源区', 183, 1, 0),
       ('慈利县', 183, 1, 0),
       ('桑植县', 183, 1, 0),
       ('赫山区', 184, 1, 0),
       ('资阳区', 184, 1, 0),
       ('安化县', 184, 1, 0),
       ('桃江县', 184, 1, 0),
       ('南县', 184, 1, 0),
       ('沅江市', 184, 1, 0),
       ('北湖区', 185, 1, 0),
       ('苏仙区', 185, 1, 0),
       ('桂阳县', 185, 1, 0),
       ('宜章县', 185, 1, 0),
       ('永兴县', 185, 1, 0),
       ('嘉禾县', 185, 1, 0),
       ('临武县', 185, 1, 0),
       ('汝城县', 185, 1, 0),
       ('桂东县', 185, 1, 0),
       ('安仁县', 185, 1, 0),
       ('资兴市', 185, 1, 0),
       ('零陵区', 186, 1, 0),
       ('冷水滩区', 186, 1, 0),
       ('祁阳县', 186, 1, 0),
       ('东安县', 186, 1, 0),
       ('双牌县', 186, 1, 0),
       ('道县', 186, 1, 0),
       ('江永县', 186, 1, 0),
       ('宁远县', 186, 1, 0),
       ('蓝山县', 186, 1, 0),
       ('新田县', 186, 1, 0),
       ('江华瑶族自治县', 186, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('鹤城区', 187, 1, 0),
       ('中方县', 187, 1, 0),
       ('沅陵县', 187, 1, 0),
       ('辰溪县', 187, 1, 0),
       ('溆浦县', 187, 1, 0),
       ('会同县', 187, 1, 0),
       ('麻阳苗族自治县', 187, 1, 0),
       ('新晃侗族自治县', 187, 1, 0),
       ('芷江侗族自治县', 187, 1, 0),
       ('靖州苗族侗族自治县', 187, 1, 0),
       ('通道侗族自治县', 187, 1, 0),
       ('洪江市', 187, 1, 0),
       ('娄星区', 188, 1, 0),
       ('冷水江市', 188, 1, 0),
       ('涟源市', 188, 1, 0),
       ('双峰县', 188, 1, 0),
       ('新化县', 188, 1, 0),
       ('吉首市', 189, 1, 0),
       ('泸溪县', 189, 1, 0),
       ('凤凰县', 189, 1, 0),
       ('花垣县', 189, 1, 0),
       ('保靖县', 189, 1, 0),
       ('古丈县', 189, 1, 0),
       ('永顺县', 189, 1, 0),
       ('龙山县', 189, 1, 0),
       ('荔湾区', 190, 1, 0),
       ('越秀区', 190, 1, 0),
       ('海珠区', 190, 1, 0),
       ('天河区', 190, 1, 0),
       ('白云区', 190, 1, 0),
       ('黄埔区', 190, 1, 0),
       ('番禺区', 190, 1, 0),
       ('花都区', 190, 1, 0),
       ('南沙区', 190, 1, 0),
       ('从化区', 190, 1, 0),
       ('增城区', 190, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('南山区', 191, 1, 0),
       ('罗湖区', 191, 1, 0),
       ('龙岗区', 191, 1, 0),
       ('盐田区', 191, 1, 0),
       ('宝安区', 191, 1, 0),
       ('光明区', 191, 1, 0),
       ('坪山区', 191, 1, 0),
       ('大鹏新区', 191, 1, 0),
       ('横琴新区', 192, 1, 0),
       ('香洲区', 192, 1, 0),
       ('斗门区', 192, 1, 0),
       ('金湾区', 192, 1, 0),
       ('南澳县', 193, 1, 0),
       ('澄海区', 193, 1, 0),
       ('潮阳区', 193, 1, 0),
       ('潮南区', 193, 1, 0),
       ('龙湖区', 193, 1, 0),
       ('濠江区', 193, 1, 0),
       ('禅城区', 194, 1, 0),
       ('南海区', 194, 1, 0),
       ('顺德区', 194, 1, 0),
       ('三水区', 194, 1, 0),
       ('高明区', 194, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('武江区', 195, 1, 0),
       ('浈江区', 195, 1, 0),
       ('曲江区', 195, 1, 0),
       ('始兴县', 195, 1, 0),
       ('仁化县', 195, 1, 0),
       ('翁源县', 195, 1, 0),
       ('乳源瑶族自治县', 195, 1, 0),
       ('新丰县', 195, 1, 0),
       ('乐昌市', 195, 1, 0),
       ('南雄市', 195, 1, 0),
       ('霞山区', 196, 1, 0),
       ('赤坎区', 196, 1, 0),
       ('坡头区', 196, 1, 0),
       ('麻章区', 196, 1, 0),
       ('遂溪县', 196, 1, 0),
       ('徐闻县', 196, 1, 0),
       ('廉江市', 196, 1, 0),
       ('雷州市', 196, 1, 0),
       ('吴川市', 196, 1, 0),
       ('端州区', 197, 1, 0),
       ('鼎湖区', 197, 1, 0),
       ('高要区', 197, 1, 0),
       ('广宁县', 197, 1, 0),
       ('怀集县', 197, 1, 0),
       ('封开县', 197, 1, 0),
       ('德庆县', 197, 1, 0),
       ('四会市', 197, 1, 0),
       ('江海区', 198, 1, 0),
       ('蓬江区', 198, 1, 0),
       ('新会区', 198, 1, 0),
       ('台山市', 198, 1, 0),
       ('开平市', 198, 1, 0),
       ('鹤山市', 198, 1, 0),
       ('恩平市', 198, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('茂南区', 199, 1, 0),
       ('电白区', 199, 1, 0),
       ('高州市', 199, 1, 0),
       ('化州市', 199, 1, 0),
       ('信宜市', 199, 1, 0),
       ('惠城区', 200, 1, 0),
       ('惠阳区', 200, 1, 0),
       ('惠东县', 200, 1, 0),
       ('博罗县', 200, 1, 0),
       ('龙门县', 200, 1, 0),
       ('梅江区', 201, 1, 0),
       ('梅县区', 201, 1, 0),
       ('大埔县', 201, 1, 0),
       ('丰顺县', 201, 1, 0),
       ('五华县', 201, 1, 0),
       ('平远县', 201, 1, 0),
       ('蕉岭县', 201, 1, 0),
       ('兴宁市', 201, 1, 0),
       ('城区', 202, 1, 0),
       ('海丰县', 202, 1, 0),
       ('陆丰市', 202, 1, 0),
       ('陆河县', 202, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('源城区', 203, 1, 0),
       ('东源县', 203, 1, 0),
       ('和平县', 203, 1, 0),
       ('龙川县', 203, 1, 0),
       ('紫金县', 203, 1, 0),
       ('连平县', 203, 1, 0),
       ('江城区', 204, 1, 0),
       ('阳东区', 204, 1, 0),
       ('阳西县', 204, 1, 0),
       ('阳春市', 204, 1, 0),
       ('清城区', 205, 1, 0),
       ('清新区', 205, 1, 0),
       ('佛冈县', 205, 1, 0),
       ('阳山县', 205, 1, 0),
       ('连山壮族瑶族自治县', 205, 1, 0),
       ('连南瑶族自治县', 205, 1, 0),
       ('英德市', 205, 1, 0),
       ('连州市', 205, 1, 0),
       ('东城街道', 206, 1, 0),
       ('南城街道', 206, 1, 0),
       ('万江街道', 206, 1, 0),
       ('莞城街道', 206, 1, 0),
       ('石碣镇', 206, 1, 0),
       ('石龙镇', 206, 1, 0),
       ('茶山镇', 206, 1, 0),
       ('石排镇', 206, 1, 0),
       ('企石镇', 206, 1, 0),
       ('横沥镇', 206, 1, 0),
       ('桥头镇', 206, 1, 0),
       ('谢岗镇', 206, 1, 0),
       ('东坑镇', 206, 1, 0),
       ('常平镇', 206, 1, 0),
       ('寮步镇', 206, 1, 0),
       ('樟木头镇', 206, 1, 0),
       ('大朗镇', 206, 1, 0),
       ('黄江镇', 206, 1, 0),
       ('清溪镇', 206, 1, 0),
       ('塘厦镇', 206, 1, 0),
       ('凤岗镇', 206, 1, 0),
       ('大岭山镇', 206, 1, 0),
       ('长安镇', 206, 1, 0),
       ('虎门镇', 206, 1, 0),
       ('厚街镇', 206, 1, 0),
       ('沙田镇', 206, 1, 0),
       ('道滘镇', 206, 1, 0),
       ('洪梅镇', 206, 1, 0),
       ('麻涌镇', 206, 1, 0),
       ('望牛墩镇', 206, 1, 0),
       ('中堂镇', 206, 1, 0),
       ('高埗镇', 206, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('石岐区', 207, 1, 0),
       ('东区', 207, 1, 0),
       ('西区', 207, 1, 0),
       ('南区', 207, 1, 0),
       ('五桂山区', 207, 1, 0),
       ('火炬开发区', 207, 1, 0),
       ('翠亨新区', 207, 1, 0),
       ('小榄镇', 207, 1, 0),
       ('黄圃镇', 207, 1, 0),
       ('民众镇', 207, 1, 0),
       ('东凤镇', 207, 1, 0),
       ('东升镇', 207, 1, 00),
       ('古镇镇', 207, 1, 0),
       ('沙溪镇', 207, 1, 0),
       ('坦洲镇', 207, 1, 0),
       ('港口镇', 207, 1, 0),
       ('三角镇', 207, 1, 0),
       ('横栏镇', 207, 1, 0),
       ('南头镇', 207, 1, 0),
       ('阜沙镇', 207, 1, 0),
       ('南朗镇', 207, 1, 0),
       ('三乡镇', 207, 1, 0),
       ('板芙镇', 207, 1, 0),
       ('大涌镇', 207, 1, 0),
       ('神湾镇', 207, 1, 0),
       ('湘桥区', 208, 1, 0),
       ('潮安区', 208, 1, 0),
       ('饶平县', 208, 1, 0),
       ('榕城区', 209, 1, 0),
       ('揭东区', 209, 1, 0),
       ('揭西县', 209, 1, 0),
       ('惠来县', 209, 1, 0),
       ('普宁市', 209, 1, 0),
       ('云城区', 210, 1, 0),
       ('云安区', 210, 1, 0),
       ('新兴县', 210, 1, 0),
       ('郁南县', 210, 1, 0),
       ('罗定市', 210, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('秀英区', 211, 1, 0),
       ('龙华区', 211, 1, 0),
       ('琼山区', 211, 1, 0),
       ('美兰区', 211, 1, 0),
       ('海棠区', 212, 1, 0),
       ('吉阳区', 212, 1, 0),
       ('天涯区', 212, 1, 0),
       ('崖州区', 212, 1, 0),
       ('西沙群岛', 213, 1, 0),
       ('南沙群岛', 213, 1, 0),
       ('中沙群岛的岛礁及其海域', 213, 1, 0),
       ('三都街道', 214, 1, 0),
       ('那大镇', 214, 1, 0),
       ('和庆镇', 214, 1, 0),
       ('南丰镇', 214, 1, 0),
       ('大成镇', 214, 1, 0),
       ('雅星镇', 214, 1, 0),
       ('兰洋镇', 214, 1, 0),
       ('光村镇', 214, 1, 0),
       ('木棠镇', 214, 1, 0),
       ('海头镇', 214, 1, 0),
       ('峨蔓镇', 214, 1, 0),
       ('王五镇', 214, 1, 0),
       ('白马井镇', 214, 1, 0),
       ('中和镇', 214, 1, 0),
       ('排浦镇', 214, 1, 0),
       ('东成镇', 214, 1, 0),
       ('新州镇', 214, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('武侯区', 215, 1, 0),
       ('锦江区', 215, 1, 0),
       ('青羊区', 215, 1, 0),
       ('金牛区', 215, 1, 0),
       ('成华区', 215, 1, 0),
       ('龙泉驿区', 215, 1, 0),
       ('青白江区', 215, 1, 0),
       ('新都区', 215, 1, 0),
       ('温江区', 215, 1, 0),
       ('双流区', 215, 1, 0),
       ('郫都区', 215, 1, 0),
       ('新津区', 215, 1, 0),
       ('都江堰市', 215, 1, 0),
       ('彭州市', 215, 1, 0),
       ('邛崃市', 215, 1, 0),
       ('崇州市', 215, 1, 0),
       ('简阳市', 215, 1, 0),
       ('自流井区', 216, 1, 0),
       ('贡井区', 216, 1, 0),
       ('大安区', 216, 1, 0),
       ('沿滩区', 216, 1, 0),
       ('荣县', 216, 1, 0),
       ('富顺县', 216, 1, 0),
       ('东区', 217, 1, 0),
       ('西区', 217, 1, 0),
       ('仁和区', 217, 1, 0),
       ('米易县', 217, 1, 0),
       ('盐边县', 217, 1, 0),
       ('江阳区', 218, 1, 0),
       ('龙马潭区', 218, 1, 0),
       ('纳溪区', 218, 1, 0),
       ('泸县', 218, 1, 0),
       ('合江县', 218, 1, 0),
       ('叙永县', 218, 1, 0),
       ('古蔺县', 218, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('旌阳区', 219, 1, 0),
       ('罗江区', 219, 1, 0),
       ('中江县', 219, 1, 0),
       ('广汉市', 219, 1, 0),
       ('什邡市', 219, 1, 0),
       ('绵竹市', 219, 1, 0),
       ('涪城区', 220, 1, 0),
       ('游仙区', 220, 1, 0),
       ('安州区', 220, 1, 0),
       ('三台县', 220, 1, 0),
       ('盐亭县', 220, 1, 0),
       ('梓潼县', 220, 1, 0),
       ('北川羌族自治县', 220, 1, 0),
       ('平武县', 220, 1, 0),
       ('江油市', 220, 1, 0),
       ('利州区', 221, 1, 0),
       ('昭化区', 221, 1, 0),
       ('朝天区', 221, 1, 0),
       ('旺苍县', 221, 1, 0),
       ('青川县', 221, 1, 0),
       ('剑阁县', 221, 1, 0),
       ('苍溪县', 221, 1, 0),
       ('船山区', 222, 1, 0),
       ('安居区', 222, 1, 0),
       ('蓬溪县', 222, 1, 0),
       ('射洪市', 222, 1, 0),
       ('大英县', 222, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('市中区', 223, 1, 0),
       ('东兴区', 223, 1, 0),
       ('五通桥区', 224, 1, 0),
       ('沙湾区', 224, 1, 0),
       ('金口河区', 224, 1, 0),
       ('顺庆区', 225, 1, 0),
       ('高坪区', 225, 1, 0),
       ('嘉陵区', 225, 1, 0),
       ('东坡区', 226, 1, 0),
       ('彭山区', 226, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('翠屏区', 227, 1, 0),
       ('南溪区', 227, 1, 0),
       ('叙州区', 227, 1, 0),
       ('江安县', 227, 1, 0),
       ('长宁县', 227, 1, 0),
       ('高县', 227, 1, 0),
       ('珙县', 227, 1, 0),
       ('筠连县', 227, 1, 0),
       ('兴文县', 227, 1, 0),
       ('屏山县', 227, 1, 0),
       ('广安区', 228, 1, 0),
       ('前锋区', 228, 1, 0),
       ('岳池县', 228, 1, 0),
       ('武胜县', 228, 1, 0),
       ('邻水县', 228, 1, 0),
       ('通川区', 229, 1, 0),
       ('达川区', 229, 1, 0),
       ('宣汉县', 229, 1, 0),
       ('开江县', 229, 1, 0),
       ('大竹县', 229, 1, 0),
       ('渠县', 229, 1, 0),
       ('名山县', 230, 1, 0),
       ('荥经县', 230, 1, 0),
       ('汉源县', 230, 1, 0),
       ('石棉县', 230, 1, 0),
       ('天全县', 230, 1, 0),
       ('芦山县', 230, 1, 0),
       ('宝兴县', 230, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('巴州区', 231, 1, 0),
       ('恩阳区', 231, 1, 0),
       ('通江县', 231, 1, 0),
       ('南江县', 231, 1, 0),
       ('平昌县', 231, 1, 0),
       ('雁江区', 232, 1, 0),
       ('安岳县', 232, 1, 0),
       ('乐至县', 232, 1, 0),
       ('马尔康市', 233, 1, 0),
       ('汶川县', 233, 1, 0),
       ('理县', 233, 1, 0),
       ('茂县', 233, 1, 0),
       ('松潘县', 233, 1, 0),
       ('九寨沟县', 233, 1, 0),
       ('金川县', 233, 1, 0),
       ('小金县', 233, 1, 0),
       ('黑水县', 233, 1, 0),
       ('壤塘县', 233, 1, 0),
       ('阿坝县', 233, 1, 0),
       ('若尔盖县', 233, 1, 0),
       ('红原县', 233, 1, 0),
       ('康定市', 234, 1, 0),
       ('泸定县', 234, 1, 0),
       ('丹巴县', 234, 1, 0),
       ('九龙县', 234, 1, 0),
       ('雅江县', 234, 1, 0),
       ('道孚县', 234, 1, 0),
       ('炉霍县', 234, 1, 0),
       ('甘孜县', 234, 1, 0),
       ('新龙县', 234, 1, 0),
       ('德格县', 234, 1, 0),
       ('白玉县', 234, 1, 0),
       ('石渠县', 234, 1, 0),
       ('色达县', 234, 1, 0),
       ('理塘县', 234, 1, 0),
       ('巴塘县', 234, 1, 0),
       ('乡城县', 234, 1, 0),
       ('稻城县', 234, 1, 0),
       ('得荣县', 234, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('西昌市', 235, 1, 0),
       ('会理市', 235, 1, 0),
       ('木里藏族自治县', 235, 1, 0),
       ('盐源县', 235, 1, 0),
       ('德昌县', 235, 1, 0),
       ('会东县', 235, 1, 0),
       ('宁南县', 235, 1, 0),
       ('普格县', 235, 1, 0),
       ('布拖县', 235, 1, 0),
       ('金阳县', 235, 1, 0),
       ('昭觉县', 235, 1, 0),
       ('喜德县', 235, 1, 0),
       ('冕宁县', 235, 1, 0),
       ('越西县', 235, 1, 0),
       ('甘洛县', 235, 1, 0),
       ('美姑县', 235, 1, 0),
       ('雷波县', 235, 1, 0),
       ('观山湖区', 236, 1, 0),
       ('南明区', 236, 1, 0),
       ('云岩区', 236, 1, 0),
       ('花溪区', 236, 1, 0),
       ('乌当区', 236, 1, 0),
       ('白云区', 236, 1, 0),
       ('开阳县', 236, 1, 0),
       ('息烽县', 236, 1, 0),
       ('修文县', 236, 1, 0),
       ('清镇市', 236, 1, 0),
       ('钟山区', 237, 1, 0),
       ('六枝特区', 237, 1, 0),
       ('水城区', 237, 1, 0),
       ('盘州市', 237, 1, 0),
       ('红花岗区', 238, 1, 0),
       ('汇川区', 238, 1, 0),
       ('播州区', 238, 1, 0),
       ('桐梓县', 238, 1, 0),
       ('绥阳县', 238, 1, 0),
       ('正安县', 238, 1, 0),
       ('道真仡佬族苗族自治县', 238, 1, 0),
       ('务川仡佬族苗族自治县', 238, 1, 0),
       ('凤冈县', 238, 1, 0),
       ('湄潭县', 238, 1, 0),
       ('余庆县', 238, 1, 0),
       ('习水县', 238, 1, 0),
       ('赤水市', 238, 1, 0),
       ('仁怀市', 238, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('西秀区', 239, 1, 0),
       ('平坝区', 239, 1, 0),
       ('普定县', 239, 1, 0),
       ('镇宁布依族苗族自治县', 239, 1, 0),
       ('关岭布依族苗族自治县', 239, 1, 0),
       ('紫云苗族布依族自治县', 239, 1, 0),
       ('七星关区', 240, 1, 0),
       ('大方县', 240, 1, 0),
       ('黔西县', 240, 1, 0),
       ('金沙县', 240, 1, 0),
       ('织金县', 240, 1, 0),
       ('纳雍县', 240, 1, 0),
       ('威宁彝族回族苗族自治县', 240, 1, 0),
       ('赫章县', 240, 1, 0),
       ('碧江区', 241, 1, 0),
       ('万山区', 241, 1, 0),
       ('江口县', 241, 1, 0),
       ('玉屏侗族自治县', 241, 1, 0),
       ('石阡县', 241, 1, 0),
       ('思南县', 241, 1, 0),
       ('印江土家族苗族自治县', 241, 1, 0),
       ('德江县', 241, 1, 0),
       ('沿河土家族自治县', 241, 1, 0),
       ('松桃苗族自治县', 241, 1, 0),
       ('兴义市', 242, 1, 0),
       ('兴仁市', 242, 1, 0),
       ('普安县', 242, 1, 0),
       ('晴隆县', 242, 1, 0),
       ('贞丰县', 242, 1, 0),
       ('望谟县', 242, 1, 0),
       ('册亨县', 242, 1, 0),
       ('安龙县', 242, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('凯里市', 243, 1, 0),
       ('黄平县', 243, 1, 0),
       ('施秉县', 243, 1, 0),
       ('三穗县', 243, 1, 0),
       ('镇远县', 243, 1, 0),
       ('岑巩县', 243, 1, 0),
       ('天柱县', 243, 1, 0),
       ('锦屏县', 243, 1, 0),
       ('剑河县', 243, 1, 0),
       ('台江县', 243, 1, 0),
       ('黎平县', 243, 1, 0),
       ('榕江县', 243, 1, 0),
       ('从江县', 243, 1, 0),
       ('雷山县', 243, 1, 0),
       ('麻江县', 243, 1, 0),
       ('丹寨县', 243, 1, 0),
       ('都匀市', 244, 1, 0),
       ('福泉市', 244, 1, 0),
       ('荔波县', 244, 1, 0),
       ('贵定县', 244, 1, 0),
       ('瓮安县', 244, 1, 0),
       ('独山县', 244, 1, 0),
       ('平塘县', 244, 1, 0),
       ('罗甸县', 244, 1, 0),
       ('长顺县', 244, 1, 0),
       ('龙里县', 244, 1, 0),
       ('惠水县', 244, 1, 0),
       ('三都水族自治县', 244, 1, 0),
       ('五华区', 245, 1, 0),
       ('盘龙区', 245, 1, 0),
       ('官渡区', 245, 1, 0),
       ('西山区', 245, 1, 0),
       ('东川区', 245, 1, 0),
       ('呈贡区', 245, 1, 0),
       ('晋宁区', 245, 1, 0),
       ('富民县', 245, 1, 0),
       ('宜良县', 245, 1, 0),
       ('石林彝族自治县', 245, 1, 0),
       ('嵩明县', 245, 1, 0),
       ('禄劝彝族苗族自治县', 245, 1, 0),
       ('寻甸回族彝族自治县', 245, 1, 0),
       ('安宁市', 245, 1, 0),
       ('麒麟区', 246, 1, 0),
       ('马龙区', 246, 1, 0),
       ('陆良县', 246, 1, 0),
       ('师宗县', 246, 1, 0),
       ('罗平县', 246, 1, 0),
       ('富源县', 246, 1, 0),
       ('会泽县', 246, 1, 0),
       ('沾益区', 246, 1, 0),
       ('宣威市', 246, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('红塔区', 247, 1, 0),
       ('江川区', 247, 1, 0),
       ('澄江市', 247, 1, 0),
       ('通海县', 247, 1, 0),
       ('华宁县', 247, 1, 0),
       ('易门县', 247, 1, 0),
       ('峨山彝族自治县', 247, 1, 0),
       ('新平彝族傣族自治县', 247, 1, 0),
       ('元江哈尼族彝族傣族自治县', 247, 1, 0),
       ('隆阳区', 248, 1, 0),
       ('施甸县', 248, 1, 0),
       ('龙陵县', 248, 1, 0),
       ('昌宁县', 248, 1, 0),
       ('昭阳区', 249, 1, 0),
       ('鲁甸县', 249, 1, 0),
       ('巧家县', 249, 1, 0),
       ('盐津县', 249, 1, 0),
       ('大关县', 249, 1, 0),
       ('永善县', 249, 1, 0),
       ('绥江县', 249, 1, 0),
       ('镇雄县', 249, 1, 0),
       ('彝良县', 249, 1, 0),
       ('威信县', 249, 1, 0),
       ('水富市', 249, 1, 0),
       ('古城区', 250, 1, 0),
       ('玉龙纳西族自治县', 250, 1, 0),
       ('永胜县', 250, 1, 0),
       ('华坪县', 250, 1, 0),
       ('宁蒗彝族自治县', 250, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('思茅区', 251, 1, 0),
       ('宁洱哈尼族彝族自治县', 251, 1, 0),
       ('墨江哈尼族自治县', 251, 1, 0),
       ('景东彝族自治县', 251, 1, 0),
       ('景谷傣族彝族自治县', 251, 1, 0),
       ('镇沅彝族哈尼族拉祜族自治县', 251, 1, 0),
       ('江城哈尼族彝族自治县', 251, 1, 0),
       ('孟连傣族拉祜族佤族自治县', 251, 1, 0),
       ('澜沧拉祜族自治县', 251, 1, 0),
       ('西盟佤族自治县', 251, 1, 0),
       ('临翔区', 252, 1, 0),
       ('凤庆县', 252, 1, 0),
       ('云县', 252, 1, 0),
       ('永德县', 252, 1, 0),
       ('镇康县', 252, 1, 0),
       ('双江拉祜族佤族布朗族傣族自治县', 252, 1, 0),
       ('耿马傣族佤族自治县', 252, 1, 0),
       ('沧源佤族自治县', 252, 1, 0),
       ('楚雄市', 253, 1, 0),
       ('双柏县', 253, 1, 0),
       ('牟定县', 253, 1, 0),
       ('南华县', 253, 1, 0),
       ('姚安县', 253, 1, 0),
       ('大姚县', 253, 1, 0),
       ('永仁县', 253, 1, 0),
       ('元谋县', 253, 1, 0),
       ('武定县', 253, 1, 0),
       ('禄丰市', 253, 1, 0),
       ('个旧市', 254, 1, 0),
       ('开远市', 254, 1, 0),
       ('蒙自市', 254, 1, 0),
       ('弥勒市', 254, 1, 0),
       ('屏边苗族自治县', 254, 1, 0),
       ('建水县', 254, 1, 0),
       ('石屏县', 254, 1, 0),
       ('泸西县', 254, 1, 0),
       ('元阳县', 254, 1, 0),
       ('红河县', 254, 1, 0),
       ('金平苗族瑶族傣族自治县', 254, 1, 0),
       ('绿春县', 254, 1, 0),
       ('河口瑶族自治县', 254, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('文山市', 255, 1, 0),
       ('砚山县', 255, 1, 0),
       ('西畴县', 255, 1, 0),
       ('麻栗坡县', 255, 1, 0),
       ('马关县', 255, 1, 0),
       ('丘北县', 255, 1, 0),
       ('广南县', 255, 1, 0),
       ('富宁县', 255, 1, 0),
       ('景洪市', 256, 1, 0),
       ('勐海县', 256, 1, 0),
       ('勐腊县', 256, 1, 0),
       ('大理市', 257, 1, 0),
       ('漾濞彝族自治县', 257, 1, 0),
       ('祥云县', 257, 1, 0),
       ('宾川县', 257, 1, 0),
       ('弥渡县', 257, 1, 0),
       ('南涧彝族自治县', 257, 1, 0),
       ('巍山彝族回族自治县', 257, 1, 0),
       ('永平县', 257, 1, 0),
       ('云龙县', 257, 1, 0),
       ('洱源县', 257, 1, 0),
       ('剑川县', 257, 1, 0),
       ('鹤庆县', 257, 1, 0),
       ('瑞丽市', 258, 1, 0),
       ('芒市', 258, 1, 0),
       ('梁河县', 258, 1, 0),
       ('盈江县', 258, 1, 0),
       ('陇川县', 258, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('泸水市', 259, 1, 0),
       ('福贡县', 259, 1, 0),
       ('贡山独龙族怒族自治县', 259, 1, 0),
       ('兰坪白族普米族自治县', 259, 1, 0),
       ('香格里拉市', 260, 1, 0),
       ('德钦县', 260, 1, 0),
       ('维西傈僳族自治县', 260, 1, 0),
       ('城关区', 261, 1, 0),
       ('七里河区', 261, 1, 0),
       ('西固区', 261, 1, 0),
       ('安宁区', 261, 1, 0),
       ('红古区', 261, 1, 0),
       ('榆中县', 261, 1, 0),
       ('皋兰县', 261, 1, 0),
       ('永登县', 261, 1, 0),
       ('雄关区', 262, 1, 0),
       ('长城区', 262, 1, 0),
       ('镜铁区', 262, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('金川区', 263, 1, 0),
       ('永昌县', 263, 1, 0),
       ('白银区', 264, 1, 0),
       ('平川区', 264, 1, 0),
       ('靖远县', 264, 1, 0),
       ('会宁县', 264, 1, 0),
       ('景泰县', 264, 1, 0),
       ('秦州区', 265, 1, 0),
       ('麦积区', 265, 1, 0),
       ('清水县', 265, 1, 0),
       ('秦安县', 265, 1, 0),
       ('甘谷县', 265, 1, 0),
       ('武山县', 265, 1, 0),
       ('张家川回族自治县', 265, 1, 0),
       ('凉州区', 266, 1, 0),
       ('民勤县', 266, 1, 0),
       ('古浪县', 266, 1, 0),
       ('天祝藏族自治县', 266, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('甘州区', 267, 1, 0),
       ('肃南裕固族自治县', 267, 1, 0),
       ('民乐县', 267, 1, 0),
       ('临泽县', 267, 1, 0),
       ('高台县', 267, 1, 0),
       ('山丹县', 267, 1, 0),
       ('崆峒区', 268, 1, 0),
       ('泾川县', 268, 1, 0),
       ('灵台县', 268, 1, 0),
       ('崇信县', 268, 1, 0),
       ('华亭市', 268, 1, 0),
       ('庄浪县', 268, 1, 0),
       ('静宁县', 268, 1, 0),
       ('肃州区', 269, 1, 0),
       ('金塔县', 269, 1, 0),
       ('瓜州县', 269, 1, 0),
       ('肃北蒙古族自治县', 269, 1, 0),
       ('阿克塞哈萨克族自治县', 269, 1, 0),
       ('玉门市', 269, 1, 0),
       ('敦煌市', 269, 1, 0),
       ('西峰区', 270, 1, 0),
       ('庆城县', 270, 1, 0),
       ('环县', 270, 1, 0),
       ('华池县', 270, 1, 0),
       ('合水县', 270, 1, 0),
       ('正宁县', 270, 1, 0),
       ('宁县', 270, 1, 0),
       ('镇原县', 270, 1, 0);


insert into districts(name, city_id, is_public, `number`)
values ('安定区', 271, 1, 0),
       ('通渭县', 271, 1, 0),
       ('陇西县', 271, 1, 0),
       ('渭源县', 271, 1, 0),
       ('临洮县', 271, 1, 0),
       ('漳县', 271, 1, 0),
       ('岷县', 271, 1, 0),
       ('武都区', 272, 1, 0),
       ('成县', 272, 1, 0),
       ('文县', 272, 1, 0),
       ('宕昌县', 272, 1, 0),
       ('康县', 272, 1, 0),
       ('西和县', 272, 1, 0),
       ('礼县', 272, 1, 0),
       ('徽县', 272, 1, 0),
       ('两当县', 272, 1, 0),
       ('临夏市', 273, 1, 0),
       ('临夏县', 273, 1, 0),
       ('康乐县', 273, 1, 0),
       ('永靖县', 273, 1, 0),
       ('广河县', 273, 1, 0),
       ('和政县', 273, 1, 0),
       ('东乡族自治县', 273, 1, 0),
       ('积石山保安族东乡族撒拉族自治县', 273, 1, 0),
       ('合作市', 274, 1, 0),
       ('临潭县', 274, 1, 0),
       ('卓尼县', 274, 1, 0),
       ('舟曲县', 274, 1, 0),
       ('迭部县', 274, 1, 0),
       ('玛曲县', 274, 1, 0),
       ('碌曲县', 274, 1, 0),
       ('夏河县', 274, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('城中区', 275, 1, 0),
       ('城东区', 275, 1, 0),
       ('城西区', 275, 1, 0),
       ('城北区', 275, 1, 0),
       ('湟中区', 275, 1, 0),
       ('大通回族土族自治县', 275, 1, 0),
       ('湟源县', 275, 1, 0),
       ('乐都区', 276, 1, 0),
       ('平安区', 276, 1, 0),
       ('民和回族土族自治县', 276, 1, 0),
       ('互助土族自治县', 276, 1, 0),
       ('化隆回族自治县', 276, 1, 0),
       ('循化撒拉族自治县', 276, 1, 0),
       ('海晏县', 277, 1, 0),
       ('祁连县', 277, 1, 0),
       ('刚察县', 277, 1, 0),
       ('门源回族自治县', 277, 1, 0),
       ('同仁市', 278, 1, 0),
       ('尖扎县', 278, 1, 0),
       ('泽库县', 278, 1, 0),
       ('河南蒙古族自治县', 278, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('共和县', 279, 1, 0),
       ('同德县', 279, 1, 0),
       ('贵德县', 279, 1, 0),
       ('兴海县', 279, 1, 0),
       ('贵南县', 279, 1, 0),
       ('玛沁县', 280, 1, 0),
       ('班玛县', 280, 1, 0),
       ('甘德县', 280, 1, 0),
       ('达日县', 280, 1, 0),
       ('久治县', 280, 1, 0),
       ('玛多县', 280, 1, 0),
       ('杂多县', 281, 1, 0),
       ('称多县', 281, 1, 0),
       ('治多县', 281, 1, 0),
       ('囊谦县', 281, 1, 0),
       ('曲麻莱县', 281, 1, 0),
       ('格尔木市', 282, 1, 0),
       ('德令哈市', 282, 1, 0),
       ('茫崖市', 282, 1, 0),
       ('乌兰县', 282, 1, 0),
       ('都兰县', 282, 1, 0),
       ('天峻县', 282, 1, 0);


insert into districts (name, city_id, is_public, `number`)
values ('中正区', 283, 1, 0),
       ('万华区', 283, 1, 0),
       ('大同区', 283, 1, 0),
       ('中山区', 283, 1, 0),
       ('松山区', 283, 1, 0),
       ('大安区', 283, 1, 0),
       ('信义区', 283, 1, 0),
       ('内湖区', 283, 1, 0),
       ('南港区', 283, 1, 0),
       ('士林区', 283, 1, 0),
       ('北投区', 283, 1, 0),
       ('文山区', 283, 1, 0),
       ('板桥区', 284, 1, 0),
       ('汐止区', 284, 1, 0),
       ('新店区', 284, 1, 0),
       ('永和区', 284, 1, 0),
       ('中和区', 284, 1, 0),
       ('土城区', 284, 1, 0),
       ('树林区', 284, 1, 0),
       ('三重区', 284, 1, 0),
       ('新庄区', 284, 1, 0),
       ('芦洲区', 284, 1, 0),
       ('瑞芳区', 284, 1, 0),
       ('三峡区', 284, 1, 0),
       ('莺歌区', 284, 1, 0),
       ('淡水区', 284, 1, 0),
       ('万里区', 284, 1, 0),
       ('金山区', 284, 1, 0),
       ('深坑区', 284, 1, 0),
       ('石碇区', 284, 1, 0),
       ('平溪区', 284, 1, 0),
       ('双溪区', 284, 1, 0),
       ('贡寮区', 284, 1, 0),
       ('坪林区', 284, 1, 0),
       ('乌来区', 284, 1, 0),
       ('泰山区', 284, 1, 0),
       ('林口区', 284, 1, 0),
       ('五股区', 284, 1, 0),
       ('八里区', 284, 1, 0),
       ('三芝区', 284, 1, 0),
       ('石门区', 284, 1, 0),
       ('桃园区', 285, 1, 0),
       ('中坜区', 285, 1, 0),
       ('平镇区', 285, 1, 0),
       ('八德区', 285, 1, 0),
       ('杨梅区', 285, 1, 0),
       ('芦竹区', 285, 1, 0),
       ('大溪区', 285, 1, 0),
       ('龙潭区', 285, 1, 0),
       ('龟山区', 285, 1, 0),
       ('大园区', 285, 1, 0),
       ('观音区', 285, 1, 0),
       ('新屋区', 285, 1, 0),
       ('复兴区', 285, 1, 0),
       ('中区', 286, 1, 0),
       ('东区', 286, 1, 0),
       ('南区', 286, 1, 0),
       ('西区', 286, 1, 0),
       ('北区', 286, 1, 0),
       ('北屯区', 286, 1, 0),
       ('西屯区', 286, 1, 0),
       ('南屯区', 286, 1, 0),
       ('太平区', 286, 1, 0),
       ('大里区', 286, 1, 0),
       ('雾峰区', 286, 1, 0),
       ('乌日区', 286, 1, 0),
       ('丰原区', 286, 1, 0),
       ('后里区', 286, 1, 0),
       ('石冈区', 286, 1, 0),
       ('东势区', 286, 1, 0),
       ('和平区', 286, 1, 0),
       ('新社区', 286, 1, 0),
       ('潭子区', 286, 1, 0),
       ('大雅区', 286, 1, 0),
       ('神冈区', 286, 1, 0),
       ('大肚区', 286, 1, 0),
       ('沙鹿区', 286, 1, 0),
       ('龙井区', 286, 1, 0),
       ('梧栖区', 286, 1, 0),
       ('清水区', 286, 1, 0),
       ('大甲区', 286, 1, 0),
       ('外埔区', 286, 1, 0),
       ('大安区', 286, 1, 0);


INSERT INTO districts (name, city_id, is_public, `number`)
VALUES ('新营区', 287, 1, 0),
       ('盐水区', 287, 1, 0),
       ('白河区', 287, 1, 0),
       ('东区', 287, 1, 0),
       ('南区', 287, 1, 0),
       ('北区', 287, 1, 0),
       ('中西区', 287, 1, 0),
       ('安平区', 287, 1, 0),
       ('安南区', 287, 1, 0),
       ('永康区', 287, 1, 0),
       ('佳里区', 287, 1, 0),
       ('西港区', 287, 1, 0),
       ('麻豆区', 287, 1, 0),
       ('善化区', 287, 1, 0),
       ('新市区', 287, 1, 0),
       ('关庙区', 287, 1, 0),
       ('归仁区', 287, 1, 0),
       ('左营区', 288, 1, 0),
       ('楠梓区', 288, 1, 0),
       ('鼓山区', 288, 1, 0),
       ('三民区', 288, 1, 0),
       ('盐埕区', 288, 1, 0),
       ('前金区', 288, 1, 0),
       ('新兴区', 288, 1, 0),
       ('苓雅区', 288, 1, 0),
       ('旗津区', 288, 1, 0),
       ('小港区', 288, 1, 0),
       ('凤山区', 288, 1, 0),
       ('大寮区', 288, 1, 0),
       ('大树区', 288, 1, 0),
       ('鸟松区', 288, 1, 0),
       ('仁武区', 288, 1, 0),
       ('桥头区', 288, 1, 0),
       ('梓官区', 288, 1, 0),
       ('弥陀区', 288, 1, 0),
       ('茄萣区', 288, 1, 0),
       ('湖内区', 288, 1, 0);


-- fitments
INSERT INTO fitments (name, `key`, created_at, updated_at)
VALUES ('毛坯', NULL, NOW(), NOW()),
       ('一般', NULL, NOW(), NOW()),
       ('简装', NULL, NOW(), NOW()),
       ('精装', NULL, NOW(), NOW()),
       ('豪华装修', NULL, NOW(), NOW()),
       ('其它', NULL, NOW(), NOW());


-- cats
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (1, '住宅', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (2, '别墅', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (3, '排屋', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (4, '公寓', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (5, '洋房', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (6, '其他', NOW(), NOW());
INSERT INTO cats
    (id, name, created_at, updated_at)
VALUES (7, '商办', NOW(), NOW());

-- 枚举参数
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('一室', 0, 0, 'shi', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('两室', 1, 0, 'shi', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('三室', 3, 0, 'shi', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('四室', 4, 0, 'shi', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('一厅', 1, 0, 'ting', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('两厅', 2, 0, 'ting', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('三厅', 3, 0, 'ting', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('无', 0, 0, 'ting', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('无', 0, 0, 'wei', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('一卫', 1, 0, 'wei', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('两卫', 2, 0, 'wei', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 3, 0, 'wei', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('线上报名活动', 0, 0, 'tour_cat', 1, NULL, NULL, NOW(), NOW(), 'default', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('口令核销', 0, 0, 'coupon_confirm_method', 1, NULL, NULL, NOW(), NOW(), 'password', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('扫码核销', 1, 0, 'coupon_confirm_method', 1, NULL, NULL, NOW(), NOW(), 'qr', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('助力领取', 3, 0, 'tour_cat', 1, NULL, NULL, NOW(), NOW(), 'zhuli', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('整数', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'integer', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('长整数', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'bigint', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('字符串', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'string', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('文本', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'text', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('日期', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'date', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('日期时间', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'datetime', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('布尔', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'boolean', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('浮点', 10, 0, 'value_type', 1, NULL, NULL, NOW(), NOW(), 'float', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('50㎡以下', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '0,50', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('50-70㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '50,70', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('70-90㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '70,90', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('90-110㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '90,110', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('110-130㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '110,130', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('130-150㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '130,150', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('150-200㎡', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '150,200', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('200㎡以上', 0, 0, 'areaList', 1, NULL, NULL, NOW(), NOW(), '200,999', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('刚需', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '刚需', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('改善', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '改善', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('投资', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '投资', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('学区', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '学区', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('给父母住', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '给父母住', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 0, 0, 'purposeList', 1, NULL, NULL, NOW(), NOW(), '其它', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('1居', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '1', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('2居', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '2', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('3居', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '3', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('4居', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '4', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('5居', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '5', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('5居以上', 0, 0, 'housetypeList', 1, NULL, NULL, NOW(), NOW(), '6', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('区位价值', 10, 0, 'post_points', 1, NULL, NULL, NOW(), NOW(), 'quwei', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('园林绿化', 10, 0, 'post_points', 1, NULL, NULL, NOW(), NOW(), 'yuanlin', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('教育配套', 10, 0, 'post_points', 1, NULL, NULL, NOW(), NOW(), 'jiaoyu', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('立即报名', 0, 0, 'tour_join_btn', 1, NULL, NULL, NOW(), NOW(), '立即报名', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('立即参与', 0, 0, 'tour_join_btn', 1, NULL, NULL, NOW(), NOW(), '立即参与', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('我要报名', 0, 0, 'tour_join_btn', 1, NULL, NULL, NOW(), NOW(), '我要报名', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('全民经纪人', 0, 0, 'broker_group', 1, NULL, NULL, NOW(), NOW(), 'quanmin', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('渠道经纪人', 0, 0, 'broker_group', 1, NULL, NULL, NOW(), NOW(), '1', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('物业服务', 10, 0, 'post_points', 1, NULL, NULL, NOW(), NOW(), 'wuye', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('装修标准', 10, 0, 'post_points', 1, NULL, NULL, NOW(), NOW(), 'zhuangxiu', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('二手房信息表', 10, 0, 'eav_table', 1, NULL, NULL, NOW(), NOW(), 'old_house', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('默认', 10, 0, 'post_theme', 1, NULL, NULL, NOW(), NOW(), 'default', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('蓝色', 10, 0, 'post_theme', 1, NULL, NULL, NOW(), NOW(), 'blue', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('置业顾问', 10, 0, 'broker_group', 1, NULL, NULL, NOW(), NOW(), 'broker', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('图片', 10, 0, 'post_banner_cat', 1, NULL, NULL, NOW(), NOW(), 'image', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('VR', 10, 0, 'post_banner_cat', 1, NULL, NULL, NOW(), NOW(), 'vr', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('视频', 10, 0, 'post_banner_cat', 1, NULL, NULL, NOW(), NOW(), 'video', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('幼儿园', 10, 0, 'post_map_tabs', 1, NULL, NULL, NOW(), NOW(), 'youeryuan', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('中学', 10, 0, 'post_map_tabs', 1, NULL, NULL, NOW(), NOW(), 'zhongxue', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('商场', 10, 0, 'post_map_tabs', 1, NULL, NULL, NOW(), NOW(), 'shangchang', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('外部小程序', 10, 0, 'tour_cat', 1, NULL, NULL, NOW(), NOW(), 'weapp', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('出售', 0, 0, 'house_business', 1, NULL, NULL, NOW(), NOW(), '出售', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('出租', 0, 0, 'house_business', 1, NULL, NULL, NOW(), NOW(), '出租', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('审核中', 0, 0, 'house_publish_status', 1, NULL, NULL, NOW(), NOW(), '审核中', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('已发布', 0, 0, 'house_publish_status', 1, NULL, NULL, NOW(), NOW(), '已发布', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('未通过', 0, 0, 'house_publish_status', 1, NULL, NULL, NOW(), NOW(), '未通过', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('已成交', 0, 0, 'house_publish_status', 1, NULL, NULL, NOW(), NOW(), '已成交', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('已下架', 0, 0, 'house_publish_status', 1, NULL, NULL, NOW(), NOW(), '已下架', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('毛坯', 0, 0, 'house_fitment', 1, NULL, NULL, NOW(), NOW(), '毛坯', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('精装', 0, 0, 'house_fitment', 1, NULL, NULL, NOW(), NOW(), '精装', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('一般', 0, 0, 'house_fitment', 1, NULL, NULL, NOW(), NOW(), '一般', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('豪华', 0, 0, 'house_fitment', 1, NULL, NULL, NOW(), NOW(), '豪华', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 0, 0, 'house_fitment', 1, NULL, NULL, NOW(), NOW(), '其它', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('住宅', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '住宅', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('公寓', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '公寓', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('商铺', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '商铺', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('别墅', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '别墅', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('办公室', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '办公室', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('车位', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '车位', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 0, 0, 'house_cat', 1, NULL, NULL, NOW(), NOW(), '其它', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('住宅', 0, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '住宅', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('朝南', 10, 0, 'house_position', 1, NULL, NULL, NOW(), NOW(), '朝南', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('朝北', 10, 0, 'house_position', 1, NULL, NULL, NOW(), NOW(), '朝北', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('我是业主', 10, 0, 'house_seller', 1, NULL, NULL, NOW(), NOW(), '业主', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('我是经纪人', 10, 0, 'house_seller', 1, NULL, NULL, NOW(), NOW(), '经纪人', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('首购刚需', 10, 0, 'house_dir', 1, NULL, NULL, NOW(), NOW(), '首购刚需', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('品质置换', 10, 0, 'house_dir', 1, NULL, NULL, NOW(), NOW(), '品质置换', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('幼儿园', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '幼儿园', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('小学', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '小学', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('中学', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '中学', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('美食', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '美食', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('购物', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '购物', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('公交', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '公交', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('地铁', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '地铁', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('银行', 10, 0, 'surround_cat', 1, NULL, NULL, NOW(), NOW(), '银行', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('新房', 11, 0, 'business_type', 1, NULL, NULL, NOW(), NOW(), 'xinfang', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('二手房', 12, 0, 'business_type', 1, NULL, NULL, NOW(), NOW(), 'ershoufang', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('朝东', 11, 0, 'house_position', 1, NULL, NULL, NOW(), NOW(), '朝东', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('朝西', 12, 0, 'house_position', 1, NULL, NULL, NOW(), NOW(), '朝西', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 13, 0, 'house_position', 1, NULL, NULL, NOW(), NOW(), '其它', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('公寓', 1, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '公寓', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('商铺', 2, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '商铺', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('别墅', 3, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '别墅', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('办公室', 4, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '办公室', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('车位', 5, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '车位', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('其它', 6, 0, 'house_category', 1, NULL, NULL, NOW(), NOW(), '其它', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('低层', 0, 0, 'floor', 1, NULL, NULL, NOW(), NOW(), '1', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('中层', 1, 0, 'floor', 1, NULL, NULL, NOW(), NOW(), '2', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('高层', 2, 0, 'floor', 1, NULL, NULL, NOW(), NOW(), '3', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('待出让', 0, 0, 'tupai_status', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('已成交', 1, 0, 'tupai_status', 1, NULL, NULL, NOW(), NOW(), '1', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('流拍', 2, 0, 'tupai_status', 1, NULL, NULL, NOW(), NOW(), '2', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('终止', 3, 0, 'tupai_status', 1, NULL, NULL, NOW(), NOW(), '3', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('无', 2, 0, 'auth_type', 1, NULL, NULL, NOW(), NOW(), '0', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('小程序用户', 1, 0, 'auth_type', 1, NULL, NULL, NOW(), NOW(), '1', 0);
INSERT INTO enumerations
(name, `number`, is_default, cat, active, parent_id, parent_name, created_at, updated_at, value, is_delete)
VALUES ('管理员', 0, 0, 'auth_type', 1, NULL, NULL, NOW(), NOW(), '2', 0);


-- event cats
INSERT INTO event_cats (name, value, created_at, updated_at)
VALUES ('楼盘资讯', 'news', NOW(), NOW()),
       ('开盘加推', 'open', NOW(), NOW()),
       ('价格变动', 'price', NOW(), NOW());


-- tags
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('品质楼盘', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('央企开发', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('知名开发商', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('配套成熟', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('超大赠送', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('地铁物业', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('小户型', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('低单价', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('小型社区', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('低密居所', '#1989FA', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('新盘首开', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('车位充足', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('复式', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('品牌房企', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('现房', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('环线房', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('花园洋房', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('绿色住宅', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('南北通透', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('大户型', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('装修交付', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('厨卫全明', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('三房朝南', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('大阳台', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('大型社区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('远郊新城', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('一房一价', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('低单价', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('大平层', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('绿色住宅', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('高绿化率', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('人车分流', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('智能住宅', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('双卫生间', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('沿街商铺', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('低容积', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('项目在建', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('今年交房', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('购物中心', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('刚需直选', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('山景地产', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('便利店', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('全朝南', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('改善置业', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('自带商业', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('医院', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('学校', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('银行', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('办公首选', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('公园', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('特惠', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('商业街', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('小型社区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('二至三环', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('知名物业', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('轨交房', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('地铁沿线', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('综合商铺', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('市场商铺', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('自由分割', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('商业街区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('专业市场', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('江景地产', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('vr看房', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('loft', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('社区底商', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('首付五成', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('湖景地产', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('品牌商铺', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('叠加别墅', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('项目封顶', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('不限购', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('品质好房', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('高性价比', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('商圈热盘', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('自持物业', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('新开发区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('普通住宅', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('品牌地产', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('水景地产', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('公交直达', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('配套齐全', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('带装修', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('住宅底商', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('成熟商圈', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('近主干道', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('热搜盘', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('人气楼盘', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('品牌开发商', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('科技住宅', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('宜居生态环境', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('市场类商铺', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('商用公寓', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('酒店式公寓', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('特色别墅', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('自持商业', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('绿化率高', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('特价房源', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('高新开发区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('叠拼', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('豪华居住区', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('合院', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('洋房', '#BE1111', NULL, NOW(), NOW(), 'post'),
       ('稀缺LOFT', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('刚需首选', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('配套成熟', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('地铁物业', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('小户型', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('低单价', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('小型社区', '#1989FA', NULL, NOW(), NOW(), 'house');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('低密居所', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('车位充足', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('复式', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('配套齐全', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('近地铁', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('交通便利', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('可办公', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('采光好', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('空中花园', '#1989fa', NULL, NOW(), NOW(), 'post'),
       ('生态住宅', '#1989fa', NULL, NOW(), NOW(), 'post');
INSERT INTO tags (name, color, `number`, created_at, updated_at, module_key)
VALUES ('在售', '#010C17', NULL, NOW(), NOW(), 'post');


-- myconfigs
INSERT INTO myconfigs
(xcx_app_id, xcx_secret, company_name, company_desc, service_mobile, service_wechat, is_saas, is_trial, expire_time,
 instance_status, instance_id, instance_name,
 admin_auth_codforce_logine, project_id, login_method, force_login, adv_link, server_stop, fenxiao_enable, cdn_domain,
 cdn_https, eventsub_enable, tour_enable,
 xcx_name, xcx_qr, xcx_qr_test, xcx_version, xcx_status, xcx_status_desc, project_uid, qq_map_key, oversea_enable,
 tim_app_id, tim_app_secret, logo, lpr_rate,
 created_at, updated_at, service_wechat_qr, xcx_copyright, xcx_updated_at, about_us, `statement`, watermark,
 protected_days, confirm_hours, report_rule, protected_hours,
 confirm_days, msg_tpl_id, server_init, upload_allowed_extension, api_host, weapp_init, email_host, email_port,
 email_protocol, email_username, email_password)
VALUES ('', '', '公司名称', '', '无', '', 0, 0, NULL, 0, 0, '', NULL, NULL, 1, 0, 0, 0, 1, '', 1, 0, 0, '小程序名称',
        NULL, NULL, '1.0', NULL, NULL, NULL, '', 0, NULL, NULL,
        'https://qiniucdn.udeve.net/udyk/6555ca584049db2b0c23871c.png', 4.65, NOW(), NOW(), '', NULL, NULL,
        '关于我们',
        '1、楼盘及房源所示户型图,房屋用途,交易权属，建成年代，产权年代，建筑结构等仅供参考看,购房时请以房本信息为准。2、楼盘及房源介绍中的配套，在建设施，规划设施，地铁信息，绿化率，得房率，容积率等信息为通过网络，房产证,跑盘,政府规划官网等渠迫状取,因时间，政策会发生变化,与实际情况可能存在偏差，楼盘及房源介绍仅供参考。3、楼盘及房源介绍中与距离相关的数据均来自腾讯，及百度地图。4、楼盘土地使用起止年限详见业主土地证明材料或直询相关政府部门的登记文件。5、楼盘及房源所示信息仅供参考，购房时请以该房屋档案登记信息，产权证信息以及所签订合同条款约定为准;本房源公示信息不做合同条款，不具有合同约束力。',
        1, 8, 48, '这里填写详细的规则说明', 1, 1, '', 0,
        'bmp,gif,jpg,jpeg,png,ico,doc,docx,xls,xlsx,ppt,pptx,html,htm,txt,pdf,pps,ppsx,odt,PSD,mp3,m4a,ogg,wav,mp4,m4v,mov,wmv,avi,mpg,ogv,3gp,3g2',
        NULL, 0, NULL, NULL, 'smtp', NULL, NULL);


-- 菜单
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (3, '楼盘管理', 'post', '/fangyuan', '', '', 0, 'dir', 1, NULL, NULL, NOW(), NOW(), 1, '');
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (4, '楼盘管理', 'xin', 'loupan', 'xinfang/index', 'xinfang', 0, 'menu', 0, 3, 'admin_posts', NOW(), NOW(), 1,
        '');
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (5, '新建楼盘', '', '', '', '', 0, 'button', 0, 4, 'create_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (6, '上架', '', '', '', '', 0, 'button', 0, 4, 'public_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (7, '下架', '', '', '', '', 0, 'button', 0, 4, 'unpublic_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (8, '删除', '', '', '', '', 0, 'button', 0, 4, 'delete_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (9, '楼盘分类', '', '', '', '', 0, 'button', 0, 4, 'albums', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (10, '楼盘置顶', '', '', '', '', 0, 'button', 0, 4, 'isTop_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (11, '更新', '', '', '', '', 0, 'button', 0, 4, 'update_post', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (12, '楼盘详情', 'setting', 'update/:id', 'xinfangUpdate/index', 'update', 1, 'menu', 0, 3, NULL, NOW(), NOW(),
        1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (13, '楼盘基本信息管理', '', '', '', '', 0, 'button', 0, 12, 'update_post_baseinfo', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (14, '楼盘轮播图管理', '', '', '', '', 0, 'button', 1, 12, 'update_post_banner', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (15, '楼盘亮点管理', '', '', '', '', 0, 'button', 2, 12, 'update_post_point', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (16, '楼盘评测管理', '', '', '', '', 0, 'button', 3, 12, 'update_post_review', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (17, '楼盘参数管理', '', '', '', '', 0, 'button', 4, 12, 'update_post_metacontent', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (18, '楼盘详细介绍管理', '', '', '', '', 0, 'button', 5, 12, 'update_post_detailcontent', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (19, '楼盘户型管理', '', '', '', '', 0, 'button', 6, 12, 'update_post_type', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (20, '楼盘相册管理', '', '', '', '', 0, 'button', 8, 12, 'update_post_xiangce', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (21, '楼盘问答管理', '', '', '', '', 0, 'button', 9, 12, 'update_post_qa', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (22, '楼盘动态管理', '', '', '', '', 0, 'button', 10, 12, 'update_post_event', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (23, '楼盘置业顾问管理', '', '', '', '', 0, 'button', 11, 12, 'update_post_broker', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (24, '楼盘咨询管理', '', '', '', '', 0, 'button', 12, 12, 'update_post_news', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (25, '楼盘风格管理', '', '', '', '', 0, 'button', 14, 12, 'update_post_theme', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (26, '预约看房', 'el-icon-alarm-clock', 'bookings/:id', 'bookings/index', 'bookings', 1, 'menu', 10, 3, '',
        NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (27, '删除', '', '', '', '', 0, 'button', 10, 26, 'delete_booking_log', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (28, '导出数据', '', '', '', '', 0, 'button', 30, 26, 'download_booking_logs', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (29, '楼盘分类', 'el-icon-coin', '/post-albums', 'albums/index', 'albums', 0, 'menu', 100, 3, 'albums', NOW(),
        NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (30, '修改', '', '', '', '', 0, 'button', 0, 29, 'update_album', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (31, '删除', '', '', '', '', 0, 'button', 1, 29, 'delete_album', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (32, '添加', '', '', '', '', 0, 'button', 4, 29, 'create_album', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (33, '客户需求', 'el-icon-edit-outline', 'xuqiu', 'needs/index', 'needs', 0, 'menu', 1000, 3, NULL, NOW(), NOW(),
        1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (34, '导出客户需求', '', '', '', '', 0, 'button', 1, 33, 'export_needs', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (35, '内容运营', 'news', '/cms', '', '', 0, 'dir', 1, NULL, NULL, NOW(), NOW(), 1, '');
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (36, '文章管理', 'news', 'index', 'news/index', '', 0, 'menu', 0, 35, 'admin_news', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (37, '删除', '', '', '', '', 0, 'button', 0, 36, 'delete_news', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (38, '编辑', '', '', '', '', 0, 'button', 0, 36, 'update_news', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (39, '创建', '', '', '', '', 0, 'button', 0, 36, 'create_news', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (40, '文章分类管理', '', '', '', '', 0, 'button', 10, 36, 'news_cats', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (41, '视频管理', 'el-icon-video-play', 'videos', 'videos/index', 'videos', 0, 'menu', 0, 35, NULL, NOW(), NOW(),
        1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (42, '添加视频', '', '', '', '', 0, 'button', 0, 41, 'create_video', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (43, '更新视频按钮', '', '', '', '', 0, 'button', 0, 41, 'update_video', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (44, '删除视频按钮', '', '', '', '', 0, 'button', 0, 41, 'delete_video', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (49, '客户反馈', 'form', 'feedbacks', 'feedbacks/index', 'feedbacks', 0, 'menu', 10, 35, NULL, NOW(), NOW(), 1,
        NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (50, '删除客户反馈', '', '', '', '', 0, 'button', 0, 49, 'delete_feedback', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (51, '二手房管理', 'home', '/ershou', '', '', 0, 'dir', 1, NULL, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (52, '房源管理', 'shou', 'old', 'old/index', 'old', 0, 'menu', 0, 51, 'admin_old_houses', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (53, '添加', '', '', '', '', 0, 'button', 10, 52, 'create_house', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (54, '删除', '', '', '', '', 0, 'button', 20, 52, 'delete_house', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (55, '修改', '', '', '', '', 0, 'button', 30, 52, 'update_house', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (56, '二手房详情', 'setting', 'ershouupdate/:id', 'oldUpdate/index', 'ershouupdate', 1, 'menu', 1, 51, '', NOW(),
        NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (57, '客户管理', 'user', '/account', '', '', 0, 'dir', 5, NULL, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (58, '客户账号', 'el-icon-s-custom', 'customers', 'customers/index', 'customers', 0, 'menu', 1, 57, NULL, NOW(),
        NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (59, '导出客户账号', '', '', '', '', 0, 'button', 1, 58, 'export_user_profile', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (60, '营销活动', 'event', '/huodong', '', '', 0, 'dir', 20, NULL, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (61, '线上活动', 'tour', 'tuan', 'tours/index', 'tours', 0, 'menu', 10, 60, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (62, '新建活动', '', '', '', '', 0, 'button', 0, 61, 'create_tour', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (63, '编辑活动', '', '', '', '', 0, 'button', 0, 61, 'update_tour', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (64, '删除活动', '', '', '', '', 0, 'button', 0, 61, 'delete_tour', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (66, '系统管理', 'setting', '/system', '', '', 0, 'dir', 40, NULL, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (67, '系统设置', 'sysSetting', 'system', 'system/index', 'system', 0, 'menu', 0, 66, NULL, NOW(), NOW(), 1,
        NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (68, '系统地图设置', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_map', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (69, '页面路径查询', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_pageurl', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (70, '系统文件管理', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_file', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (71, '系统楼盘标签', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_posttag', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (72, '系统城市设置', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_cities', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (73, '系统参数设置', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_sysconfig', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (74, '枚举值管理', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_enum', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (75, '系统服务器参数', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_server', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (77, '联系方式', '', '', '', '', 0, 'button', 0, 67, 'update_contact_info', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (78, '邮件设置', '', '', '', '', 0, 'button', 0, 67, 'update_myconfig_mail', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (79, '权限管理', 'check', '/permission', '', '', 0, 'dir', 50, NULL, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (80, '菜单项目', 'menu', 'menus', 'menus/index', 'menus', 0, 'menu', 0, 79, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (81, '删除', '', '', '', '', 0, 'button', 10, 80, 'delete_permission_item', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (82, '修改', '', '', '', '', 0, 'button', 20, 80, 'update_permission_item', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (83, '添加', '', '', '', '', 0, 'button', 30, 80, 'create_permission_item', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (85, '角色管理', 'el-icon-s-help', 'roles', 'roles/index', '', 0, 'menu', 0, 79, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (86, '删除', '', '', '', '', 0, 'button', 10, 85, 'delete_role', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (87, '编辑', '', '', '', '', 0, 'button', 20, 85, 'update_role', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (88, '添加', '', '', '', '', 0, 'button', 30, 85, 'create_role', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (89, '操作日志', 'el-icon-s-order', 'logs', 'logs/index', 'logs', 0, 'menu', 1, 79, NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (90, '导出操作日志', '', '', '', '', 0, 'button', 1, 89, 'export_logs', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (91, '后台账号管理', 'el-icon-user-solid', 'adminusers', 'adminusers/index', 'adminusers', 0, 'menu', 10, 79,
        NULL, NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (92, '新建', '', '', '', '', 0, 'button', 10, 91, 'create_adminuser', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (93, '修改', '', '', '', '', 0, 'button', 20, 91, 'update_adminuser', NOW(), NOW(), 1, NULL);
INSERT INTO permission_items
(id, title, icon, `path`, component_path, component_name, hidden, cat, `order`, father_id, `key`, created_at,
 updated_at, enable, redirect)
VALUES (94, '删除', '', '', '', '', 0, 'button', 30, 91, 'delete_adminuser', NOW(), NOW(), 1, NULL);


-- 菜单与角色关联
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 3, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 4, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 5, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 6, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 7, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 8, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 9, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 10, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 11, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 12, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 13, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 14, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 15, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 16, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 17, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 18, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 19, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 20, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 21, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 22, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 23, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 24, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 25, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 26, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 27, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 28, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 29, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 30, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 31, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 32, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 33, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 34, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 35, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 36, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 37, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 38, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 39, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 40, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 41, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 42, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 43, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 44, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 49, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 50, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 51, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 52, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 53, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 54, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 55, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 56, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 57, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 58, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 59, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 60, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 61, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 62, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 63, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 64, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 66, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 67, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 68, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 69, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 70, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 71, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 72, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 73, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 74, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 75, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 77, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 78, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 79, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 80, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 81, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 82, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 83, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 85, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 86, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 87, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 88, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 89, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 90, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 91, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 92, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 93, NOW(), NOW());
INSERT INTO role_permission_items
    (role_id, permission_item_id, created_at, updated_at)
VALUES (1, 94, NOW(), NOW());


-- albums
INSERT INTO albums
(name, `key`, cover, cat, content, title, `number`, created_at, updated_at, can_delete)
VALUES ('人气榜', NULL, NULL, 'default', '排行榜单楼盘', '人气榜', NULL, NOW(), NOW(), 0);
INSERT INTO albums
(name, `key`, cover, cat, content, title, `number`, created_at, updated_at, can_delete)
VALUES ('关注榜', NULL, NULL, 'default', '排行榜单楼盘', '关注榜', NULL, NOW(), NOW(), 0);
INSERT INTO albums
(name, `key`, cover, cat, content, title, `number`, created_at, updated_at, can_delete)
VALUES ('综合榜', NULL, NULL, 'default', '排行榜单楼盘', '综合榜', NULL, NOW(), NOW(), 0);
INSERT INTO albums
(name, `key`, cover, cat, content, title, `number`, created_at, updated_at, can_delete)
VALUES ('热搜榜', NULL, NULL, 'default', '排行榜单楼盘', '热搜榜', NULL, NOW(), NOW(), 0);


-- poster_templates
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('纸纹', 0, '', '#333333', NULL, 0, NOW(), NOW(), 12);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('炫彩', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 13);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('炫蓝', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 14);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('活力', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 15);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('纷飞', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 16);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('祥云', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 17);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('炫紫', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 18);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('波纹', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 19);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('3D绿', 0, '', '#ffffff', NULL, 0, NOW(), NOW(), 20);
INSERT INTO poster_templates
(name, is_default, bg, font_color, cover, can_delete, created_at, updated_at, `number`)
VALUES ('炫绿', 1, '', '#ffffff', NULL, 0, NOW(), NOW(), 21);



-- 销售状态
INSERT INTO sale_status_items (name, color, icon, created_at, updated_at, module_key)
VALUES ('待售', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('在售', '#1989FA', NULL, NOW(), NOW(), 'post'),
       ('售罄', '#CECECE', NULL, NOW(), NOW(), 'post'),
       ('在售', '#1989FA', NULL, NOW(), NOW(), 'house'),
       ('已售', '#CECECE', NULL, NOW(), NOW(), 'house'),
       ('待租', '#1989FA', NULL, NOW(), NOW(), 'rental'),
       ('已租', '#CECECE', NULL, NOW(), NOW(), 'rental');
