/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
// components/pagemaker/banners/index.js
const link = require("../link")
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },



  observers: {

  },


  /**
   * 组件的初始数据
   */
  data: {
    heightValue: '150rpx',
  },

  /**
   * 组件的方法列表
   */
  methods: {

    linkHandle: function (e) {
      wx.showModal({
        title: '未设置公众号',
        content: '请在关注组件中设置公众号，设置后可点击关注',
        complete: (res) => {
        }
      })
    }

  }
})
