/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
// components/choose-block/choose-block.js
Component({
    /**
     * 组件的属性列表
     */
    properties: {
        options: {
            type: Array,
            value: ''
        },
        value: {
            type: String,
            value: ''
        },

    },

    /**
     * 组件的初始数据
     */
    data: {

    },

    /**
     * 组件的方法列表
     */
    methods: {
        change (e) {
            var { item } = e.currentTarget.dataset
            this.triggerEvent("changeStatus", { item })
        }
    }
})
