/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/

// components/copyright.js
// 本项目已进行软件著作权登记，社区版必须保留此版权信息，否则构成侵权。若需移除，请购买专业版。

const app = getApp()

Component({
    /**
     * 组件的属性列表
     */
    properties: {

    },

    ready: function () {

    },

    /**
     * 组件的初始数据
     */
    data: {
        text: "优得（西安）信息科技有限公司 版权所有"
    },

    /**
     * 组件的方法列表
     */
    methods: {

      showToast(){
        wx.showToast({
          title: '©友得云客版权所有',
          icon: 'none',
        })
      },

        sayHello: function () {
            wx.showToast({
                icon: 'none',
                title: '优得:www.udeve.net',
            })
        }
    }
})
