/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
export default {
    formatUtcDatetime: function (val) {
        return 'hello'
    },
    utcFormater: function (value) {
        if (!value) {
            return ''
        }
        var r = value.split("T");
        var year = r[0];
        if (!r[1]) {
            return r[0]
        }
        var s = r[1].split(".");
        var time = s[0];
        return year + " " + time;
    }

}