<!--
+----------------------------------------------------------------------
| 友得云客  - 开启房产营销新纪元
+----------------------------------------------------------------------
| Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
+----------------------------------------------------------------------
| Licensed 友得云客不是自由软件 未经允许不可移除相关版权
+----------------------------------------------------------------------
| Author: www.youdeyunke.com
+----------------------------------------------------------------------
-->
<template>
    <div class="app-container">
        <advanced-card title="积分商城-功能介绍" desc="管理员可以设置积分商品，吸引小程序用户以每日进入小程序签到、分享楼盘等方式获取积分，兑换积分商品。"></advanced-card>
    </div>
</template>

<script>
import advancedCard from "../advancedCard.vue";
export default {
    name: "scoregood",
    components: { advancedCard },
};
</script>

<style scoped lang="scss"></style>
