<!--
+----------------------------------------------------------------------
| 友得云客  - 开启房产营销新纪元
+----------------------------------------------------------------------
| Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
+----------------------------------------------------------------------
| Licensed 友得云客不是自由软件 未经允许不可移除相关版权
+----------------------------------------------------------------------
| Author: www.youdeyunke.com
+----------------------------------------------------------------------
-->
<template>
    <div class="app-container">
        <advanced-card title="购房日历-功能介绍" desc="用于在小程序端查询购房日历信息，管理端设置楼盘开盘、开始认购信息后，会在小程序端以日历的形式展示。"></advanced-card>
    </div>
</template>

<script>
import advancedCard from "../advancedCard.vue";
export default {
    name: "rili",
    components: { advancedCard },
};
</script>

<style scoped lang="scss"></style>
