/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
const app = getApp()
module.exports = {

    setCity: function () {
        // 根据获取到的位置信息自动判断用户所在城市
        // 如果无法获取位置信息，或者关闭了权限，则设置默认位置
        var _this = this

        wx.getFuzzyLocation({
            type: 'gcj02 ',
            altitude: false,
            isHighAccuracy: false,
            success: function (poi) {
                // 解析地址
                console.log("获取当前地理位置", poi)
            },
            fail: function (res) {
                // TODO 获取位置信息失败
                // console.log("无法获取当前定位信息", res)
            },
        })
    },

}