<!--
+----------------------------------------------------------------------
| 友得云客  - 开启房产营销新纪元
+----------------------------------------------------------------------
| Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
+----------------------------------------------------------------------
| Licensed 友得云客不是自由软件 未经允许不可移除相关版权
+----------------------------------------------------------------------
| Author: www.youdeyunke.com
+----------------------------------------------------------------------
-->
<template>
    <div class="app-container">
        <advanced-card title="土拍查询-功能介绍" desc="用于在小程序端查询土拍信息，小程序端用户可订阅土拍；订阅后管理端发布新的土拍信息，小程序端会收到消息推送提醒。"></advanced-card>
    </div>
</template>

<script>
import advancedCard from "../advancedCard.vue";
export default {
    name: "tupai",
    components: { advancedCard },
};
</script>

<style scoped lang="scss"></style>
