/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
Page({

  /**
   * 页面的初始数据
   */
  data: {
    message:''
  },

  restartProgram(){
    wx.restartMiniProgram({
      path: '/pages/home/home'
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    if(options.key == 'noapi'){
      this.setData({
        message: "系统检测到您尚未配置 API 主机地址，请前往 '/utils/request.js' 文件中的 'apiHost' 进行配置。将apiHost设置为您的服务端运行地址。确保将 API 主机地址正确设置，以便小程序能够正常发起网络请求和访问数据。如需帮助，请参考相关文档或联系系统管理员。", 
      })
    } else if (options.key == 'duankouapi'){
      this.setData({
        message: "系统检测到您的 API 地址为IP地址，请点击微信小程序开发工具右上角详情 -> 本地设置 -> 勾选'不校验合法域名、web-view(业务域名)、TLS版本以及 HTTPS 证书'，以便小程序能够正常发起网络请求和访问数据。如需帮助，请参考相关文档或联系系统管理员。"
      })
    }
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})