/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');

/** 
 * 二维码模块接口
 * **/

// 拉取二维码详细信息  完成 
export function getQrDetail (qrId) {
    return request.get("/api/v6/qrs/" + qrId);
}



// 生成一张带数据的二维图片   1
export function createQrImage (path, extData) {
    return request.post("/api/v6/qrs/", {
        path: path,
        qr_data: extData
    });
}