/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request');

/** 
 * 活动模块接口
 * **/

// 拉取活动列表
export function getTourList (query) {
    return request.get("/api/v6/tours/", query);
}

// 拉取活动详情
export function getTourDetail (tourId, query = {}) {
    return request.get("/api/v6/tours/" + tourId, query);
}