/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');

// 拉取视频列表
export function getVideoList (query) {
	return request.get("/api/v6/videos", query);
}

// 增加视频浏览量
export function addVideoViews (id) {
	return request.post("/api/v6/videos/view/" + id);
}