/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: www.youdeyunke.com
* +----------------------------------------------------------------------
*/
// components/box.js
Component({
    options: {
    },
    /**
     * 组件的属性列表
     */
    properties: {
        width: {
            type: Number, value: 750,
        },

        radius: {
            type: Number, value: 2,
        },

        shadow: {
            type: Boolean, value: false,
        },

        padding: {
            type: Number, value: 0,
        },


    },

    /**
     * 组件的初始数据
     */
    data: {

    },

    /**
     * 组件的方法列表
     */
    methods: {

    }
})
