/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自由软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: UDEVE Team <tech@udeve.cn>
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');

/** 
 * need模块相关api
 * **/

// 拉取need列表    1   不用了
export function getNeedList (query = {}) {
    return request.get("/api/v1/needs/", query);
}

export function submitNeed (data) {
    return request.post("/api/v6/needs/", data);
}