/**
* +----------------------------------------------------------------------
* | 友得云客  - 开启房产营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2019~2023 优得（西安）信息科技有限公司版权所有
* +----------------------------------------------------------------------
* | Licensed 友得云客不是自有软件 未经允许不可移除相关版权
* +----------------------------------------------------------------------
* | Author: UDEVE Team <tech@udeve.cn>
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');


// 查询热门搜索列表  1
export function getHotSearchList (query) {
    return request.get("/api/v6/hot_search", query);
}

// 当用户搜索某个楼盘的时候，标记热门搜索   1
export function createHoutSearch (postId) {
    return request.post("/api/v6/hot_search", { post_id: postId });
}